{
  "title": "Pornography",
  "url": "https://en.wikipedia.org/wiki/Pornography",
  "content": "Pornography (colloquially called porn or porno) is sexually suggestive material, such as a picture, video, text, or audio, intended for sexual arousal. Made for consumption by adults, pornographic depictions have evolved from cave paintings, some forty millennia ago, to modern-day virtual reality presentations. A general distinction of adults-only sexual content is made, classifying it as pornography or erotica.\nThe oldest artifacts considered pornographic were discovered in Germany in 2008 and are dated to be at least 35,000 years old. Human enchantment with sexual imagery representations has been a constant throughout history. However, the reception of such imagery varied according to the historical, cultural, and national contexts. The Indian Sanskrit text Kama Sutra (3rd century CE) contained prose, poetry, and illustrations regarding sexual behavior, and the book was celebrated; while the British English text Fanny Hill (1748), considered \"the first original English prose pornography,\" has been one of the most prosecuted and banned books. In the late 19th century, a film by Thomas Edison that depicted a kiss was denounced as obscene in the United States, whereas Eugène Pirou's 1896 film Bedtime for the Bride was received very favorably in France. Starting from the mid-twentieth century on, societal attitudes towards sexuality became lenient in the Western world where legal definitions of obscenity were made limited. In 1969, Blue Movie by Andy Warhol became the first film to depict unsimulated sex that received a wide theatrical release in the United States. This was followed by the \"Golden Age of Porn\" (1969–1984). The introduction of home video and the World Wide Web in the late 20th century led to global growth in the pornography business. Beginning in the 21st century, greater access to the Internet and affordable smartphones made pornography more mainstream.\nPornography has been vouched to provision a safe outlet for sexual desires that may not be satisfied within relationships and be a facilitator of sexual fulfillment in people who do not have a partner. Pornography consumption is found to induce psychological moods and emotions similar to those evoked during sexual intercourse and casual sex. Pornography usage is considered a widespread recreational activity in-line with other digitally mediated activities such as use of social media or video games. People who regard porn as sex education material were identified as more likely not to use condoms in their own sex life, thereby assuming a higher risk of contracting sexually transmitted infections (STIs); performers working for pornographic studios undergo regular testing for STIs unlike much of the general public. Comparative studies indicate higher tolerance and consumption of pornography among adults tends to be associated with their greater support for gender equality. Among feminist groups, some seek to abolish pornography believing it to be harmful, while others oppose censorship efforts insisting it is benign. A longitudinal study ascertained pornography use is not a predictive factor in intimate partner violence. Porn Studies, started in 2014, is the first international peer-reviewed, academic journal dedicated to critical study of pornographic \"products and services\".\nPornography is a major influencer of people's perception of sex in the digital age; numerous pornographic websites rank among the top 50 most visited websites worldwide. Called an \"erotic engine\", pornography has been noted for its key role in the development of various communication and media processing technologies. For being an early adopter of innovations and a provider of financial capital, the pornography industry has been cited to be a contributing factor in the adoption and popularization of media related technologies. The exact economic size of the porn industry in the early twenty-first century is unknown. In 2023, estimates of the total market value stood at over US$172 billion. The legality of pornography varies across countries. People hold diverse views on the availability of pornography. From the mid-2010s, unscrupulous pornography such as deepfake pornography and revenge porn have become issues of concern.\n\n\n== Etymology and definition ==\nThe word pornography is a conglomerate of two ancient Greek words: πόρνος (pórnos) \"fornicators\",\nand γράφειν (gráphein) \"writing, recording, or description\". In Greek language, the term pornography connotes depiction of sexual activity; no date is known for the first use of the term pornography, the earliest attested, most related word found is πορνογράφος (pornographos) i.e. \"someone writing about harlots\" in the 3rd century CE work Deipnosophists by Athenaeus.\nThe oldest published reference to the word pornography as in 'new pornographie,' is dated back to 1638 and is credited to Nathaniel Butter in a history of the Fleet newspaper industry. The modern word pornography entered the English language as the more familiar word in 1842 via French \"pornographie,\" from Greek \"pornographos\".\nThe term porn is an abbreviation of pornography. The related term πόρνη (pórnē) \"prostitute\" in Greek, originally meant \"bought, purchased\" similar to pernanai \"to sell\", from the proto-Indo-European root per-, \"to hand over\" — alluding to act of selling.\nThe word pornography was originally used by classical scholars as \"a bookish, and therefore inoffensive term for writing about prostitutes\", but its meaning was quickly expanded to include all forms of \"objectionable or obscene material in art and literature\". In 1864, Webster's Dictionary published \"a licentious painting\" as the meaning for pornography, and the Oxford English Dictionary: \"obscene painting\" (1842), \"description of obscene matters, obscene publication\" (1977 or earlier).\nDefinitions for the term \"pornography\" are varied, with people from both pro- and anti-pornography groups defining it either favorably or unfavorably, thus making any definition very stipulative. Nevertheless, academic researchers have defined pornography as sexual subject material such as a picture, video, text, or audio that is primarily intended to assist sexual arousal in the consumer, and is created and commercialized with \"the consent of all persons involved\". Arousal is considered the primary objective, the raison d'etre a material must fulfill for it to be treated as pornographic. As some people can feel aroused by an image that is not meant for sexual arousal and conversely cannot feel aroused by material that is clearly intended for arousal, the material that can be considered as pornography becomes subjective.\n\n\n== Pornography throughout history ==\n\n\n=== Pornography from ancient times ===\n\nPornography is viewed by historians as a complex cultural formation. Depictions of a sexual nature existed since prehistoric times as seen in Venus figurines and rock art. People across various civilizations created works that depicted explicit sex; these include artifacts, music, poetry, and murals among other things that are often intertwined with religious and supernatural themes. The oldest artifacts, including the Venus of Hohle Fels, which is considered to be borderline pornographic, were discovered in 2008 CE at a cave near Stuttgart in Germany, radiocarbon dating suggests they are at least 35,000 years old, from the Aurignacian period.\n\nVast number of artifacts discovered in ancient Mesopotamia region had explicit depictions of heterosexual sex. Glyptic art from the Sumerian Early Dynastic Period frequently showed scenes of frontal sex in the missionary position. In Mesopotamian votive plaques from the early second millennium (c. 2000 – c. 1500 BCE), a man is usually shown penetrating a woman from behind while she bends over drinking beer through a straw. Middle Assyrian lead votive figurines often portrayed a man standing and penetrating a woman as she rests on an altar. Scholars have traditionally interpreted all these depictions as scenes of hieros gamos (an ancient sacred marriage between a god and a goddess), but they are more likely to be associated with Inanna, the Mesopotamian goddess of sex and sacred prostitution. Many sexually explicit images, including models of male and female sexual organs were found in the temple of Inanna at Assur.\nDepictions of sexual intercourse were not part of the general repertory of ancient Egyptian formal art, but rudimentary sketches of heterosexual intercourse have been found on pottery fragments and in graffiti. The final two thirds of the Turin Erotic Papyrus (Papyrus 55001), an Egyptian papyrus scroll discovered at Deir el-Medina, consists of a series of twelve vignettes showing men and women in various sexual positions. The scroll was probably painted in the Ramesside period (1292–1075 BCE) and its high artistic quality indicates that it was produced for a wealthy audience. No other similar scrolls have yet been discovered.\n\nArchaeologist Nikolaos Stampolidis had noted that the society of ancient Greece held lenient attitudes towards sexual representation in the fields of art and literature. The Greek poet Sappho's Ode to Aphrodite (600 BCE) is considered an earliest example of lesbian poetry. Red-figure pottery invented in Greece (530 BCE) often portrayed images that displayed eroticism. The fifth-century BC comic Aristophanes elaborated 106 ways of describing the male genitalia and in 91 ways the female genitalia. Lysistrata (411 BCE) is a sex-war comedy play performed in ancient Greece.\n\nIn India, Hinduism embraced an inquisitive attitude towards sex as an art and a spiritual ideal. Some ancient Hindu temples incorporated various aspects of sexuality into their art work. The temples at Khajuraho and Konark are particularly renowned for their sculptures, which had detailed representations of human sexual activity. These depictions were viewed with a spiritual outlook as sexual arousal is believed to indicate the embodying of the divine.\n\n\"pornography is sometimes characterised as the symptom of a degenerate society, but anyone even noddingly familiar with Greek vases or statues on ancient Hindu temples will know that so-called unnatural sex acts, orgies and all manner of complex liaisons have for millennia past been represented in art for the pleasure and inspiration of the viewer everywhere. The desire to ponder images of love-making is clearly innate in the human – perhaps particularly the male – psyche.\" — Tom Hodgkinson\n\nKama, the word used to connote sexual desire, was explored in Indian literary works such as the Kama Sutra, which dealt with the practical as well as the psychological aspects of human courtship and sexual intercourse.\nThe Sanskrit text Kama sutra was compiled by the sage Vatsyayana into its final form sometime during the second half of the third century CE. This text, which included prose, poetry, as well as illustrations regarding erotic love and sexual behavior, is one of the most celebrated Indian erotic works. Koka shastra is another medieval Indian work that explored kama. \n\n\n==== Pornography from the Roman era ====\nWhen large-scale archaeological excavations were undertaken in the ancient Roman city of Pompeii during the 18th century, much of the erotic art in Pompeii and Herculaneum came to light, shocking the authorities who endeavored to hide them away from the general public. In 1821, the moveable objects were locked away in the Secret Museum in Naples, and what could not be removed was either covered or cordoned off from public view.\n\nOther examples of early art and literature of sexual nature include: Ars Amatoria (Art of Love), a second-century CE treatise on the art of seduction and sensuality by the Roman poet Ovid; the artifacts of the Moche people in Peru (100 CE to 800 CE); The Decameron, a collection of short stories, some of which are sexual in nature by the 14th-century Italian author Giovanni Boccaccio; and the fifteenth-century Arabic sex manual The Perfumed Garden.\n\n\n=== Pornography from early modern era ===\n\nA highly developed culture of visual erotica flourished in Japan during the early modern era. From at least the 17th century, erotic artworks became part of the mainstream social culture. Depictions of sexual intercourse were often presented on pictures that were meant to provide sex education for medical professionals, courtesans, and married couples. Makura-e (pillow pictures) were made for entertainment as well as for the guidance of married couples. The ninth-century Japanese art form \"Shunga\", which depicted sexual acts on woodblock prints and paintings became so popular by the 18th century that the Japanese government began to issue official edicts against them. Even so, Japanese erotica flourished with the works of artists such as Suzuki Harunobu achieving worldwide fame. Japanese censorship laws enacted in 1870 made the production of erotic works difficult. The laws remained in effect until the end of the Pacific War in 1945; nevertheless, pornography flourished through the sale of \"erotic, grotesque, nonsense\" (ero-guro-nansensu) periodicals, particularly in the Taishō era (1912–1926). From the 1960s, pink films, which portrayed sexual themes became popular in Japan. In 1981 the first Japanese Adult video (AV) was released. The Japanese pornography industry peaked in the early 2000s when about 30,000 AVs were made a year. From the mid-2010s, increased availability of free porn on the Internet led to a decline in the production of AVs. Other forms of adult entertainment such as hentai, which refers to pornographic manga and anime, and erotic video games have become popular in recent decades.\n\nIn Europe, the Italian Renaissance work from the 16th century - I Modi (The Ways) also known as The Sixteen Pleasures became famous for its engravings that explicitly depicted sex positions.\nThe publication of this book was considered the beginning of print pornography in Rome. The second edition of this book was published in 1527, titled Aretino Postures, which combined erotic images with text - a first in the Western culture. The Vatican called for the complete destruction of all the copies of the book and imprisonment of its author Marcantonio Raimondi. With the development of printing press in Europe, the publication of written and visual material, which was essentially pornographic began. Heptaméron written in French by Marguerite de Navarre and published posthumously in 1558 is one of the earliest examples of salacious texts from this era. Beginning with the Age of Enlightenment and advances in printing technology, the production of erotic material became popular enough that an underground marketplace for such works developed in England with a separate publishing and bookselling business. Historians have identified the 18th century as an age of pornographic opulence. Written by anonymous authors, the titles: The Progress of Nature (1744); The History of the Human Heart: or, the Adventures of a Young Gentleman (1749), which had descriptions of female ejaculation; and The Child of Nature (1774) have been noted as prominent pornographic fictional works from this period. The book Fanny Hill (1748), is considered \"the first original English prose pornography, and the first pornography to use the form of the novel.\" An erotic literary work by John Cleland, Fanny Hill was first published in England as Memoirs of a Woman of Pleasure. The novel has been one of the most prosecuted and banned books in history. The author John Cleland was charged for \"corrupting the King's subjects.\"\n\nAt around the same time, erotic graphic art that began to be extensively produced in Paris came to be known in the Anglosphere as \"French postcards\". Enlightenment-era France had been noted by historians as the center of origin for modern-era pornography. The works of French pornography, which often concentrated on the education of an ingénue into libertine, dominated the sale of sexually explicit content. The French sought to interlace narratives of sexual pleasure with philosophical and anti-establishment basis. Political pornography began with the French Revolution (1789–99). Apart from the sexual component, pornography became a popular medium for protest against the social and political norms of the time. Pornography during this period was used to explore the ideas of sexual freedom for women and men, the various methods of contraception, and to expose the offenses of powerful royals and elites. The working and lower classes in France produced pornographic material en masse with themes of impotency, incest, and orgies that ridiculed the authority of the Church-State, aristocrats, priests,\nmonks, and other royalty. \n\nOne of the most important authors of socially radical pornography was the French aristocrat Marquis de Sade (1740–1814), whose name helped derive the words \"sadism\" and \"sadist\". He advocated libertine sexuality and published writings that were critical of authorities, many of which contained pornographic content.\nHis work Justine (1791) interlaced orgiastic scenes along with extensive debates on the ills of property and traditional hierarchy in society.\n\n\n==== Pornography in the Victorian era ====\nDuring the Victorian era (1837–1901), the invention of the rotary printing press made publication of books easier, many works of lascivious nature were published during this period often under pen names or anonymity. In 1837, the Holywell Street (known as \"Booksellers' Row\") in London had more than 50 shops that sold pornographic material. Many of the works published in the Victorian era are considered bold and graphic even by today's lenient standards. The English novel The Adventures, Intrigues, and Amours, of a Lady's Maid! written by anonymous \"Herself\" (c. 1838) professed the notion that homosexual acts are more pleasurable for women than heterosexuality which is linked to painful and uncomfortable experiences. Some of the popular publications from this era include: The Pearl (magazine of erotic tales and poems published from 1879 to 1881); Gamiani, or Two Nights of Excess (1870) by Alfred de Musset; and Venus in Furs (1870) by Leopold von Sacher-Masoch, from whose name the term \"masochism\" was derived. The Sins of the Cities of the Plain (1881) is one of the first sole male homosexual literary work published in English, this work is said to have inspired another gay literary work Teleny, or The Reverse of the Medal (1893), whose authorship has often been attributed to Oscar Wilde. The Romance of Lust, written anonymously and published in four volumes during 1873–1876, contained graphical descriptions of themes detailing incest, homosexuality, and orgies. Other publications from the Victorian era that included fetish and taboo themes such as sadomasochism and 'cross-generational sex' are: My Secret Life (1888–1894) and Forbidden Fruit (1898). On accusations of obscenity many of these works had been outlawed until the 1960s.\n\n\n=== Criminalization ===\n\n\n==== The English act ====\nThe world's first law that criminalized pornography was the English Obscene Publications Act 1857, enacted at the urging of the Society for the Suppression of Vice. The act passed by the British Parliament in 1857 applied to the United Kingdom and Ireland. The act made the sale of obscene material a statutory offense, and gave the authorities the power to seize and destroy any material which they considered as obscene.\nFor centuries before, sexually explicit material was considered a domain that is exclusive to aristocratic classes. When pornographic material flourished in the Victorian-era England, the affluent classes believed they are sensible enough to deal with it, unlike the lower working classes whom they thought would get distracted by such material and cease to be productive. Beliefs that masturbation would make people ill, insane, or become blind also flourished. The obscenity act gave government officials the power to interfere in the private lives of people unlike any other law before. Some of the people suspected for masturbation were forced to wear chastity devices. \"Cures\" and \"treatment\" for masturbation involved such measures like giving electric shock and applying carbolic acid to the clitoris. The law was criticized for being established on still yet unproven claims that sexual material is noxious for people or public health.\n\n\n==== The American act ====\nIn 1865, the US postal service was seen as a \"vehicle\" for the transmission of materials that were deemed obscene by the American lawmakers. An act relating to the postal services was passed, which made people pay a fine of $500 for knowingly mailing any \"obscene book, pamphlet, picture print, or other publication\". From 1865 to up until the first three months of 1872, a total number of nine people were held for various charges of obscenity, with one person sentenced to prison for a year; while in the next ten months fifteen people were arrested under this law. This was partly due to the efforts of Anthony Comstock, who became a major figure in 1872 and held great power to control sexual related activities of people including the choice of abortion.\nThe Comstock Act of 1873 is the American equivalent of the English Obscene Act. The anti-obscenity bill, drafted by Anthony Comstock, was debated for less than an hour in the US Congress before being passed into law. Apart from the power to seize and destroy any material alleged to be obscene, the law made it possible for the authorities to make arrests over any perceived act of obscenity, which included possession of contraceptives by married couples. Reportedly in the US, 15 tons of books and 4 million pictures were destroyed, and about 15 people were driven to suicide with 4,000 arrests. At least 55 people whom Comstock identified as abortionists got indicted under the Comstock act.\n\n\n==== Steps towards liberalization ====\nThe laws regarding pornography have differed in various historical, cultural, and national contexts. The English Act did not apply to Scotland where the common law continued to apply. Before the English Act, publication of obscene material was treated as a common law misdemeanor, this made effectively prosecuting authors and publishers difficult even in cases where the material was clearly intended as pornography. However, neither the English, nor the United States Act defined what constituted \"obscene\", leaving this for the courts to determine. For implementing the Comstock act, the US courts used the British Hicklin test to define obscenity, the definition of which was first proposed in 1868, ten years after the passing of the English obscene act. The definition became cemented in 1896 and continued until the mid-twentieth century. Starting from 1957 to 1997, the US Supreme Court made numerous judgments that redefined obscenity.\nThe nineteenth-century legislation eventually outlawed the publication, retail and trafficking of certain writings and images that were deemed pornographic. Although laws ordered the destruction of shop and warehouse stock meant for sale, the private possession and viewing of (some forms of) pornography was not made an offense until the twentieth century. Historians have explored the role of pornography in determining social norms. The Victorian attitude that pornography was only for a select few is seen in the wording of the Hicklin test, stemming from a court case in 1868, where it asked: \"whether the tendency of the matter charged as obscenity is to deprave and corrupt those whose minds are open to such immoral influences\".\nAlthough officially prohibited, the sale of sexual material nevertheless continued through \"under the counter\" means. Magazines specialising in a genre called \"saucy and spicy\" became popular during this time (1896 to 1955), titles of few popular magazines include; Wink: A Whirl of Girls, Flirt: A FRESH Magazine, and Snappy. Cover stories in these magazines featured segments such as \"perky pin-ups\" and \"high-heel cuties\". Some of the popular erotic literary works from the twentieth century include the novels: Story of the Eye (1928), Tropic of Cancer (1934), Tropic of Capricorn (1938), the French Histoire d'O (Story of O) (1954); and the short stories: Delta of Venus (1977), and Little Birds (1979).\n\n\n==== Invention of photography and filmography ====\nAfter the invention of photography, the birth of erotic photography followed. The oldest surviving image of a pornographic photo is dated back to about 1846, described as to depict \"a rather solemn man gingerly inserting his penis into the vagina of an equally solemn and middle-aged woman\". At one point of time, it was more expensive to purchase an erotic photograph than to hire a prostitute. The Parisian demimonde included Napoleon III's minister, Charles de Morny, an early patron who delighted in acquiring and displaying erotic photos at large gatherings.\nPornographic film production commenced almost immediately after the invention of the motion picture in 1895. A pioneer of the motion picture camera, Thomas Edison, released various films, including The Kiss that were denounced as obscene in late 19th century America. Two of the earliest pioneers of pornographic films were Eugène Pirou and Albert Kirchner. Kirchner directed the earliest surviving pornographic film for Pirou under the trade name \"Léar\". The 1896 film, Le Coucher de la Mariée, showed Louise Willy performing a striptease. Pirou's film inspired a genre of risqué French films that showed women disrobing, and other filmmakers realized profits could be made from such films.\n\n\n=== Legalization ===\nSexually explicit films opened producers and distributors to be liable for prosecution. Such films were produced illicitly by amateurs, starting in the 1920s, primarily in France and the United States. Processing the film was risky as was their distribution, which was strictly private. In the Western world, during the 1960s, social attitudes towards sex and pornography slowly changed.\nIn 1967, Denmark repealed the obscenity laws on literature; this led to a decline in the sale of pornographic and erotic literature. Hoping for a similar effect, in the summer of 1969, legislators in Denmark abolished censorship on picture pornography, thereby effectively becoming, from July 1, 1969, the first country that legalized pornography, including child pornography, which was later prohibited in 1980. The 1969 legislation, instead of resulting in a decline in pornography production, led to an explosion of investment in, and commercial production of pornography in Denmark, which made the country's name synonymous with sex and pornography. The total retail turnover of pornography in Denmark for the year 1969 was estimated at $50 million. Much of the pornographic material produced in Denmark was smuggled into other countries around the world.\n\nIn the United States, pornography is protected by the First Amendment to the United States Constitution unless it constitutes obscenity or child pornography that is produced with real children. Nevertheless, in Stanley v. Georgia (1969), the U.S. Supreme Court upheld the right of an adult to possess obscene material in private. Subsequently, however, the Supreme Court rejected the claim that under Stanley there is a constitutional right to provide obscene material for private use or to acquire it for private use. The right to possess obscene material does not imply the right to provide or acquire it, because the right to possess it \"reflects no more than ... the law's 'solicitude to protect the privacies of the life within [the home]'\".\nIn 1969, Blue Movie by Andy Warhol became the first feature film to depict explicit sexual intercourse that received a wide public theatrical release in the United States.\n\nFilm scholar Linda Williams remarked that prurience \"is a key term in any discussion of moving-image sex since the sixties. Often it is the \"interest\" to which no one wants to own up\". In 1968, the Motion Picture Association of America created a new film ratings system in which any film that was not approved by the association was released with an \"X\" rating. When pornographers began to release their productions with the rating X, the association adopted NC-17 rating for adults only films, leaving the X rating to pornography. Later the invented gimmick rating \"XXX\" became a standard for pornographic material.\n\n\n==== Commissions and their findings ====\nIn 1970, the United States President's Commission on Obscenity and Pornography, set up to study the effects of pornography, reported that there was \"no evidence to date that exposure to explicit sexual materials plays a significant role in the causation of delinquent or criminal behavior among youths or adults\". The report further recommended against placing any restriction on the access of pornography by adults and suggested that legislation \"should not seek to interfere with the right of adults who wish to do so to read, obtain, or view explicit sexual materials\". Regarding the notion that sexually explicit content is improper, the Commission found it \"inappropriate to adjust the level of adult communication to that considered suitable for children\". The Supreme Court supported this view.\nIn 1971, Sweden removed its obscenity clause. Further relaxation of legislations during the early 1970s in the US, West Germany and other countries led to rise in pornography production. The 1970s had been described by Linda Williams as 'the \"Classical\" Era of Theatrically Exhibited Porn', a time period now called the Golden Age of Porn.\nIn 1979, the British Committee on Obscenity and Film Censorship better known as the Williams Committee, formed to review the laws concerning obscenity reported that pornography could not be harmful and to think anything else is to see pornography \"out of proportion\". The committee declared that existing variety of laws in the field should be scrapped and so long as it is prohibited from children, adults should be free to consume pornography as they see fit.\nThe Meese Report in 1986 argued against loosening restrictions on pornography in the US. The report was criticized as biased, inaccurate, and not credible.\nIn 1988, the Supreme Court of California ruled in the People v. Freeman case that \"filming sexual activity for sale\" does not amount to procuring or prostitution and shall be given protection under the first amendment. This ruling effectively legalized the production of X-rated adult content in the Los Angeles county, which by 2005 had emerged as the largest center in the world for the production of pornographic films. Pornographic films appeared throughout the twentieth century. First as stag films (1900–1940s), then as porn loops or short films for peep shows (1960s), followed by as feature films for theatrical release in adult movie theaters (1970s), and as home videos (1980s).\n\n\n==== Role of magazines in legalization ====\nPornographic magazines published during the mid-twentieth century have been noted for playing an important role in the sexual revolution and the liberalization of laws and attitudes towards sexual representation in the Western world. Hugh Hefner, in 1953 published the first US issue of the Playboy, a magazine which as Hefner described is a \"handbook for the urban male\". The magazine contained images of nude women along with articles and interviews covering politics and culture. Twelve years later, in 1965, Bob Guccione in the UK started his publication Penthouse, and published its first American issue in 1969 as a direct competitor to Playboy. In its early days, the images of naked women published in Playboy did not show any pubic hair or genitals. Penthouse became the first magazine to show pubic hair in 1970. Playboy followed the lead and there ensued a competition between the two magazines over publication of more racy pictures, a contest that eventually got labeled as the \"Pubic Wars\".\n\n\"We were the first to show full frontal nudity. The first to expose the clitoris completely. I think we made a very serious contribution to the liberalization of laws and attitudes. HBO would not have gone as far as it does if it was not for us breaking the barriers. Much that has happened now in the Western world with respect to sexual advances is directly due to steps that we took.\" — Bob Guccione, Penthouse founder in 2004.\n\nThe tussle between Playboy and Penthouse paled into obscurity when Larry Flynt started Hustler, which became the first magazine to publish labial \"pink shots\" in 1974. Hustler projected itself as the magazine for the working classes as opposed to the urban centered Playboy and Penthouse. During the same time in 1972, Helen Gurley Brown, editor of the Cosmopolitan magazine, published a centerfold that featured actor Burt Reynolds in nude. His popular pose has been later emulated by many other famous people. The success of Cosmo led to the launch of Playgirl in 1973. At their peak, Playboy sold close to six million copies a month in the US, while Penthouse nearly five million. In the 2010s, as the market for printed versions of pornographic magazines declined, with Playboy selling about a million and Penthouse about a hundred thousand, many magazines became online publications. As of 2005, the best-selling US adult magazines maintained greater reach compared to most other non-pornographic magazines, and often ranked among top-sellers.\n\n\n=== Modern-day pornography ===\nModern-day pornography began to take shape from the mid-1980s when the first desktop computers and public computer networks were released.\nSince the 1990s, the Internet has made pornography more accessible and culturally visible. Before the 90s, Usenet newsgroups served as the base for what has been called the \"amateur revolution\" where non-professionals from the late 1980s and early 1990s, with the help of digital cameras and the Internet, created and distributed their own pornographic content independent of mainstream networks. The use of the World Wide Web became popular with the introduction of Netscape navigator in 1994. This development led to newer methods of pornography distribution and consumption. The Internet turned out to be a popular source for pornography and was called the \"Triple A-Engine\" for offering consumers \"anonymity, affordability, and accessibility\", while driving the business of pornography. The notion of Internet being a medium abound with porn became popular enough that in 1995 Time published a cover story titled \"CYBERPORN\" with the face of a shocked child as the cover photo.\nIn the Reno v. ACLU (1997) ruling, the US Supreme Court upheld the legality of pornography distribution and consumption by adults over the Internet. The Court noted that government may not reduce the communication between adults to \"only what is fit for children\".\nWith the introduction of broadband connections, much of the distribution networks of pornography moved online giving consumers anonymous access to a wide range of pornographic material. To have better control over their content on the Internet some professional pornographers maintain their own websites. Danni's Hard Drive started in 1995 by Danni Ashe is considered one of the earliest online pornographic websites, coded by Ashe – a former stripper and nude model, the website was reported by CNN to had generated revenues of $6.5 million by 2000. According to some leading pornography providers on the Internet, customer subscription rates for a website would be about one in a thousand people who visit the site for a monthly fees averaging around $20. Ashe said in an interview that her website employs 45 people and she expects to earn $8 million in 2001 alone. The total number of pornographic websites in 2000 were estimated to be more than 60,000. The development of streaming sites, peer-to-peer file sharing (P2P) networks, and tube sites led to a subsequent decline in the sale of DVDs and adult magazines.\nStarting in the 21st century, greater access to the Internet and affordable smartphones made pornography more accessible and culturally mainstream. The total number of pornographic websites in 2012 was estimated to be around 25 million comprising 12% of all the websites. About 75 percent of households in the US gained Internet access by 2012. Data from 2015 suggests an increase in pornography consumption over the past few decades which is attributed to the growth of Internet pornography. Technological advancements such as digital cameras, laptops, smartphones, and Wi-Fi have democratized the production and consumption of pornography. Subscription-based service providers such as OnlyFans, founded in 2016, are becoming popular as the platforms for pornography trade in the digital era. Apart from the professional pornographers, content creators on such platforms include others like; a physics teacher, a race car driver, a woman undergoing cancer treatment. In 2022, the total pornographic content accessible online was estimated to be over 10,000 terabytes.\nAVN and XBIZ are the industry-specific organizations based in the US that provide information about the adult entertainment business. XBIZ Awards and AVN Awards, analogous to the Golden globes and Oscars, are the two prominent award shows of the adult entertainment industry. Free Speech Coalition (FSC) is a trade association and Adult Performer Advocacy Committee (APAC) is a labor union for the adult entertainment industry based in the US. The scholarly study of pornography notably in cultural studies is limited. Porn Studies, which began in 2014, is the first international peer-reviewed, academic journal that is exclusively dedicated to the critical study of the \"products and services\" identified to constitute pornography.\n\n\n== Classifications ==\n\n\n=== Adult content classifications ===\nAdult content is generally classified as either pornography or erotica. Considerations of distinctness between pornography and erotica is mostly subjective. Pornographic content is categorized as softcore or hardcore. Softcore pornography contains depictions of nudity but without explicit depiction of sexual activity. Hardcore pornography includes explicit depiction of sexual activity. Hardcore porn is more regulated than softcore porn. Softcore porn was popular between the 1970s and 1990s.\n\n\n==== Mainstream pornography ====\nPornography productions cater to consumers of various sexual orientations. Nonetheless, pornography featuring heterosexual acts made for heterosexual consumers, comprise the bulk of what is called the \"mainstream porn\", marking the industry more or less as \"heteronormative\".\nMainstream pornography involves professional performers who work for various corporate film studios in their respective productions.\n\n \nMainstream pornography productions are usually classified as feature or gonzo. Features involve storylines, characterizations, scripted dialog, elegant costumes, detailed sets, and soundtracks, which make the productions look similar to mainstream Hollywood productions but with the depictions of explicit sexual activity included. Features contain both original narratives as well as parodies that parody mainstream feature films, TV shows, celebrities, video games or literary works. Gonzo is a form of content creation that attempts to put the viewer into the scene, this is commonly achieved by close-up camera work or performers talking to the audience; also called \"wall-to-wall\", gonzo involves some aspects of \"breaking the fourth wall\" between the audience and performers. The term \"gonzo\" is often misused as a genre to identify demeaning depictions, however gonzo is a film-making style and not a genre. Gonzo style is variably incorporated in the creation of all types or genres of adult content. Gonzos do not involve the expensive sets or the costly production values of features, which makes their production relatively inexpensive. From the mid-2010s about 95 percent of porn productions are gonzo.\n\n\n==== Indie pornography ====\n\nPornography productions that are independent of mainstream pornographic studios are classified as indie (or) independent pornography. These productions cater to more specific audience, and often feature different scenarios and sexual activity compared to the mainstream porn. The performers in indie porn include real-life couples and regular people, who sometimes work in partnership with other performers. Apart from content creation the performers do the background work such as videography, editing, web development themselves, and distribute under their own brand. Paysites like Clips4Sale.com, MakeLoveNotPorn.tv, and PinkLabel.tv provide a platform to the web-based content of independent pornographers.\n\n\n=== Genres ===\nPornography encompasses a wide variety of genres providing for an enormous range of consumer tastes. Most of the genres or types are named according to the depiction of sexual activity, these include: anal, creampie, cum shot, double penetration, fisting, threesome. Categorizations based on the age of the performers include: teens, milf, mature. Other categorizations based on gender and sexual identity include: lesbian, transsexual, queer, shemale; while those based on race include: ethnic, interracial. Others include: Mormon, zombie. Pornography also features numerous fetishes like: \"'fat' porn, amateur porn, disabled porn, porn produced by women, queer porn, BDSM and body modification.\"\n\n\n== Commercialism ==\n\nPornography is commercialized mainly through the sale of pornographic films. Many adult films had theatrical releases during the 1970s corresponding with the Golden Age of Porn. A 1970 federal study estimated that the total retail value of hardcore pornography in the United States was no more than $5 million to $10 million.\nThe release of the VCR by Sony Corporation for the mass market in 1975 marked the shift of people from watching porn in adult movie theaters, to the confines of their houses. The introduction of VHS brought down the production quality through the 1980s.\nStarting in the 1990s, Internet eased the access to pornography. The pay-per-view model enabled people to buy adult content directly from cable and satellite TV service providers. According to Showtime Television network report, in 1999 adult pay-per-view services made $367 million, which was six times more than the $54 million earned in 1993. Although this development resulted in a decline in rentals, the revenues generated over the Internet, provided much financial gains for pornography producers and credit card companies among others. By the mid-1990s, the adult film industry had agents for performers, production teams, distributors, advertisers, industry magazines, and trade associations. The introduction of home video and the World Wide Web in the late twentieth century led to global growth in the pornography business. Performers got multi-film contracts. In 1998, Forrester Research reported that online \"adult content\" industry's estimated annual revenue is at $750 million to $1 billion.\nRetail stores or sex shops engaged in the sale of adult entertainment material ranging from videos, magazines, sex toys and other products, significantly contributed to the overall commercialization of pornography. Sex shops sell their products on both online shopping platforms such as Amazon and on specialized websites.\n\nIn 2000, the total annual revenue from the sales and rentals of pornographic material in the US was estimated to be over $4 billion. The hotel industry through the sale of adult movies to their customers as part of room service, over pay-per-view channels, had generated an annual income of about $180-$190 million. Some of the major companies and hotel chains that were involved in the sale of adult films over pay-per-view platforms include; AT&T, Time Warner, DirecTV from General Motors, EchoStar, Liberty Media, Marriott International, Westin and Hilton Worldwide. The companies said their services are in response to a growing American market that wanted pornography delivered at home. Studies in 2001 had put the total US annual revenue (including video, pay-per-view, Internet and magazines) between $2.6 billion and $3.9 billion.\n\nFrom the mid 2000s, emergence of tube sites led to an increase in free streaming and a decrease in traditional studio sales. Many performers turned to subscription-based platforms like OnlyFans, which continue to provide financial independence for some, but also increase market saturation, making it harder for new creators to establish themselves. Additionally, dependence on third-party platforms leaves creators vulnerable to policy changes and financial restrictions. In 2020, Visa and Mastercard implemented restrictions on processing payments for adult content due to concerns over illegal material.\nAdditionally, the arrival of AI-generated adult content, including deepfake pornography, poses ethical and legal dilemmas.\n\n\n=== Economics ===\nThe production and distribution of pornography are economic activities of some importance. In Europe, Budapest is regarded as the industry center. Other pornography production centers in the world are located in Florida (US), Brazil, Czech Republic, and Japan. In the United States, the pornography industry employs about 20,000 people including 2,000 to 3,000 performers, and is centered in the San Fernando Valley of Los Angeles. By 2005, it became the largest pornography production center in the world. Apart from regular media coverage, the industry in the US receives considerable attention from private organizations, government agencies, and political organizations.\n\nAs of 2011, pornography was becoming one of the biggest businesses in the United States. In 2014, the porn industry was believed to bring in at least $13 billion on a yearly basis in the United States. Through the 2010s, many pornography production companies and top pornographic websites such as Pornhub, RedTube and YouPorn have been acquired by MindGeek, a company that has been described as \"a monopoly\" in the pornography business. This development was identified as a problem. According to Marina Adshade, a professor from the Vancouver School of Economics and the author of Dollars and Sex: How economics influences sex and love, having a monopoly in the pornography business has forced the producers to reduce their charges, and radically changed the work of performers \"who are now under greater pressure to perform acts that they would have been able to refuse in the past\", all at a lower price without profits for themselves.\nOnline pornography is available both for a fee and free of charge. The availability of free porn on the Internet has led to a decline in the business of mainstream pornography. Piracy is estimated to result in losses of some $2 billion a year for the porn industry. Budgets of many studios reduced considerably and contracts for performers became less common. Reportedly, applications by established pornography companies for porn-shoot permits in Los Angeles County fell by 95 percent during the period 2012 to 2015. According to Mark Spiegler, an adult talent agent, in the early 2000s female performers made about $100,000 a year. By 2017, the amount is about $50,000.\nThe technological era led to decline of the studio and \"the rise of the pornography worker herself\". Newer ways of monetization have opened for the pornography workers who are taking the path of entrepreneurship. In 1995, Jenna Jameson signed her first contract with the porn studio Wicked Pictures. After building a brand image for herself she started her own company ClubJenna, which by 2005 was reportedly earning an annual revenue of $30-$35 million. \"Performers are hustlers now,\" said Chanel Preston (a performer who was also chairperson of the Adult Performer Advocacy Committee), while noting that performers have to be creative to sustain their income and reach audience, both of which, she said are mainly achieved through \"feature dancing, selling merchandise, webcamming\", among other activities. \"Custom\" pornography made according to the requests of customer clients has emerged as one new business niche. The average career for the new age performer lasts about four to six months. Before moving on to the business side, adult performers use studio works to advertise and build a brand image for themselves. They acquire an audience who would later pay at personal website or webcam performances. Commercial webcamming, which emerged in the 1990s as a niche sector in the adult entertainment industry, grew to become a multibillion-dollar business by the mid-2020s.\nThe exact economic size of the porn industry in the early-twenty-first century is unknown to anyone. Kassia Wosick, a sociologist from New Mexico State University, estimated the global porn market value at $97 billion in 2015, with the US revenue estimated at $10 and $12 billion. IBISWorld, a leading researcher of various markets and industries, calculated total US revenue to reach $3.3 billion by 2020. On the basis of a research report by a market analysis firm, USA Today published that the estimated worth of the adult entertainment industry market in 2023 is over $172 billion.\n\n\n=== Technology ===\nPornographers have taken advantage of each major technological advancement for the production and distribution of their services. Pornography has been called an \"erotic engine\" and a driving force in the development of various media related technologies from the printing press, through photography (still and motion), to satellite TV, Home video, and streaming media.\nOne of the world's leading anti-pornography campaigners, Gail Dines, has stated that \"the demand for porn has driven the development of core cross-platform technologies for data compression, search, transmission and micro-payments.\" Many of the technological developments that had been led by pornography have benefited other fields of human activity too. In the early 2000s, Wicked Pictures pushed for the adoption of the MPEG-4 file format ahead of others, this later became the most commonly used format across high-speed Internet connections. In 2009, Pink Visual became one of the first companies to license and produce content with a software introduced by a small Toronto-based company called \"Spatial view\", which later made it possible to view 3D content on iPhones.\nAs an early adopter of innovations, the pornography industry has been cited to be a crucial factor in the development and popularization of various media processing and communication technologies. From innovative smaller film cameras, to the VCRs, and the Internet, the porn industry has employed newer technologies much ahead than other commercial industries, this early adoption provided the developers their early financial capital, which aided in the further development of these technologies. The success of innovative technologies is predicted by their greater use in the porn industry.\n\nPornographic content accounted for most videotape sales during the late 1970s. The pornography industry has been considered an influential factor in deciding the format wars in media, including being a factor in the VHS vs. Betamax format war (the videotape format war) and the Blu-ray vs. HD DVD format war (the high-def format war). Piracy, the illegal copying and distribution of material, is of great concern to the porn industry. The industry has been the subject of many litigations and formalized anti-piracy efforts.\nMany of the innovative data rendering procedures, enhanced payment systems, customer service models, and security methods developed by pornography companies have been co-opted by other mainstream businesses. Pornography companies served as the basis for a large number of innovations in web development. Much of the IT work in porn companies is done by people who are referred to as a \"porn webmaster\", often paid well in what are small businesses, they have more freedom to test innovations compared to other IT employees in larger organizations who tend to be risk-averse.\n\n\n==== Virtual reality pornography ====\n\nSome pornography is produced without human actors at all. The idea of computer-generated pornography was conceived very early as one of the obvious areas of application for computer graphics. Until the late 1990s, digitally manipulated pornography could not be produced cost-effectively. In the early 2000s, it became a growing segment as the modeling and animation software matured, and the rendering capabilities of computers improved. Further advances in technology allowed increasingly photorealistic 3D figures to be used in interactive pornography. The first pornographic film to be shot in 3D was 3D Sex and Zen: Extreme Ecstasy, released on 14 April 2011, in Hong Kong.\nThe various mediums for pornography depictions have evolved throughout the course of history, starting from prehistoric cave paintings, about forty millennia ago, to futuristic virtual reality renditions. Experts in the pornography business predict more people in the future would consume porn through virtual reality headsets, which are expected to give consumers better personal experiences than they can have in the real world. Speculations are rife about an increased presence of sex robots in the future pornography productions.\n\n\n== Consumption ==\nPornography is a product made by adults-for the consumption by adults, the consumption of which has become more common among people due to the expansive use of the Internet. About 90% of pornography is consumed on the Internet with consumers preferring content that is in tune with their sexuality. Pornography has been found to be a significant influencer of people's ideas about sex in the digital age. Pornographic websites rank among the top 50 most visited websites worldwide. XVideos and Pornhub are the two most visited pornographic websites worldwide.\nPornography consumption in people is found to induce \"psychological moods and emotions\" similar to those evoked during actual sexual intercourse and casual sex. Researchers identified four broad motivating factors for pornography consumption: an innate sexual drive or desire, to learn about sex and improve ones own sexual performance, peer pressure or social groups, lack of sexual relationship or absence of partner. Majority of pornography consumers tend to be male, unmarried, with higher levels of education. Younger people are more frequent consumers of porn than older people. There's been a gradual increase in the consumption rates across different age groups with the increased availability of free porn over the Internet.\nResearchers at McGill University ascertained that on viewing pornographic content, men reached their maximum arousal in about 11 minutes and women in about 12 minutes. An average visit to a pornographic website lasts for 11.6 minutes. Both marriage and divorce are found to be associated with lower subscription rates for adult entertainment websites. Subscriptions are more widespread in regions that have higher measures of social capital. Pornographic websites are most often visited during office hours. As per a recent CNBC report, seventy per cent of online-porn access in the US happens between nine-to-five hours.\nSexual arousal and sexual enhancement tend to be the primary motivations among the self-reported reasons by users for their pornography consumption.\nStudies had found that greater levels of psychological distress leads to higher rates of pornography consumption. Pornography may provide a temporary relief from stress, or anxiety. A need to assuage coping and boredom is also found to result in higher consumption of pornography.\n\n\n=== By Gender ===\nA study of Austrian adults found that men consume pornography more frequently than women. The intent for consumption may vary, with men being more likely to use pornography as a stimulant for sexual arousal during solitary sexual activity, while women are more likely to use pornography as a source of information or entertainment, and rather prefer using it together with a partner to enhance sexual stimulation during partnered sexual activity. Studies have found that sexual functioning defined as \"a person's ability to respond sexually or to experience sexual pleasure\" is greater in women who consume pornography frequently than in women who do not. No such association was noticed in men. Women who consume pornography are more likely to know about their own sexual interests and desires, and in turn be willing and able to communicate them during partnered sexual activity, it has been reported that in women the ability to communicate their sexual preferences is associated with greater sexual satisfaction for themselves. Pornographic material is found to expand the sexual repertoire in women by making them learn new rewarding sexual behaviors such as clitoral stimulation and enhance their overall \"sexual flexibility\". Women who consume pornography frequently are more easily aroused during partnered sex and are more likely to engage in oral sex compared to the women who do not view pornography. Women users of pornography had reported (almost 50%) to have had engaged in cunnilingus, which research suggests is related to female orgasm, and to have had experienced orgasms more frequently than women who do not use pornography (87% vs. 64%). Most people, probably do not consider pornography use by a partner as indulging in infidelity.\n\n\n=== By education level ===\nA two year long survey (2018–2020) conducted to assess the role of pornography in the lives of highly educated medical university students, with median age of 24, in Germany found that pornography served as an inspiration for many students in their sex life. Pornography use among students was higher in males than in females, among the male students those who did not cheat on their partner or contracted an STI were found to be more frequent consumers of pornography. Although pornography use was more common among men, associations between pornography use and sexuality were more apparent in women. Among the female students, those who reported to be satisfied with their physical appearance have consumed three times as much pornography than the female students who had reported to be dissatisfied with their body. A feeling of physical inadequacy was found to be a restraining factor in the consumption of pornography. Female students who consume pornography more often had reported to have had multiple sexual partners. Both female and male students who enjoyed the experience of anal intercourse in their life were reported to be frequent consumers of pornography. Sexual content depicting bondage, domination, or violence was consumed by only a minority of 10%. More sexual openness and less sexual anxiety was observed in students who regularly consumed pornography. No association was noticed between regular pornography use and experience of sexual dissatisfaction in either female or male students. This finding was in concurrence with another finding from a longitudinal study, which demonstrated most pornography consumers differentiate pornographic sex from real partnered sex and do not experience diminishing satisfaction with their sex life.\n\n\n=== By region ===\nA vast majority of men and considerable number of women in the US use porn. A study in 2008 found that among University students aged 18 to 26 located in six college sites across the United States, 67% of young men and 49% of young women approved pornography viewing, with nearly 9 out of 10 men (87%) and 31% women reportedly using pornography. The Huffington Post reported in 2013 that porn websites registered higher number of visitors than Netflix, Amazon, and Twitter combined. A 2014 poll, which asked Americans when they had \"last intentionally looked at pornography\", elicited a result that 46% of men and 16% of women in the age group of 18–39 did so in the past week. A 2016 study reported that about 70% of men and 34% of women in romantic relationships use pornography annually. Gallup poll surveys conducted over the years 2011 to 2018 noted a gradual increase in the acceptance rates of pornography among the general American public.\nSince the late 1960s, attitudes towards pornography have become more positive in Nordic countries; in Sweden and Finland the consumption of pornography has increased over the years. A 2006 study of Norwegian adults found that over 80% of the respondents used pornography at some point in their lives, a difference of 20% was observed between men and women in their respective use. A 2015 study in Finland noted that 75% of the 30-40-y.o. women and above 90% of the 30-40-y.o. men found porn \"very exciting\". Of those who had watched porn during the latest year, 71% of the 18-24-y.o. women, almost 60% of the 18-49-y.o. women, and a tenth of 65+ women did so; among men, the numbers were above 90% of the men under 50-y.o., 3/4 of the 18-64-y.o. and most of the 65+ y.o.; the numbers were quickly increasing, particularly for women, partially due to increased masturbation.\nIn 2012 and 2013, interviews with large number of Australians revealed that in the past year 63% of men and 20% of women had viewed pornography.\nA 2020 Egyptian study surveying 15,027 individuals in Arab countries noted a prevalence of pornography use \"nearly similar to Danish, German, and American ones\".\nIn 2021, it was estimated that in modern countries, 46–74% of men and 16–41% of women are regular users of pornography. In 2022, a national survey in Japan, of men and women aged 20 to 69 revealed that 76% of men and 29% of women had used pornography as part of their sexual activity. A 2023 study reported that in Netherlands, young men who watched porn in the previous six months ranged between 65% (13–15-y.o.) to 96% (22–24-y.o.), and among young women between 22% (13–15-y.o.) to 75% (22–24-y.o.).\n\n\n== Legality and regulations ==\n\nThe legal status of pornography varies widely from country to country. Regulating hardcore pornography is more common than regulating softcore pornography. Child pornography is illegal in almost all countries, and some countries have restrictions on rape pornography and zoophilic pornography.\nPornography in the United States is legal provided it does not depict minors, and is not obscene. The community standards, as indicated in the Supreme Court decision, of the 1973 Miller v. California case determine what constitutes as \"obscene\". The US courts do not have jurisdiction over content produced in other countries, but anyone distributing it in the US is liable to prosecution under the same community standards. As the courts consider community standards foremost in deciding any obscenity charge, the changing nature of community standards over the course of time and place makes instances of prosecution limited.\nIn the United States, a person receiving unwanted commercial mail that he or she deems pornographic (or otherwise offensive) may obtain a Prohibitory Order. Many online sites require the user to tell the website they are a certain age and no other age verification is required. A total of 16 states and the Republican Party have passed resolutions declaring pornography a \"public health\" threat. These resolutions are symbolic and do not put any restrictions but are made to sway the public opinion on pornography. The notion of pornography as a threat to public health is not supported by any international health organization.\nThe adult film industry regulations in California requires that all performers in pornographic films use condoms. However, the use of condoms in pornography is rare. As porn does better financially when actors are without condoms many companies film in other states. Twitter is the popular social media platform used by the performers in porn industry as it does not censor content unlike Instagram and Facebook.\nPornography in Canada, as in the US, criminalizes the \"production, distribution, or possession\" of materials that are deemed obscene. Obscenity, in the Canadian context, is defined as \"the undue exploitation of sex\" provided it is connected to images of \"crime, horror, cruelty, or violence\". As to what is considered \"undue\" is decided by the courts, which assess the community standards in deciding whether exposure to the given material may result in any harm, with harm defined as \"predisposing people to act in an anti-social manner\".\n\nPornography in the United Kingdom does not have the concept of community standards. Following the highly publicized murder of Jane Longhurst, the UK government in 2009 criminalized the possession of what it terms as \"extreme pornography\". The courts decide whether any material is legally extreme or not, conviction for penalty include fines or incarceration up to three years. Content banned includes representations that are considered \"grossly offensive, disgusting, or otherwise of an obscene character\".\nWhile there are no restrictions on depiction of male ejaculation, any depiction of female ejaculation in pornography is completely banned in the UK, as well as in Australia.\nIn most of Southeast Asia, Middle East, and China, the production, distribution, and/or possession of pornography is illegal and outlawed. In Russia and Ukraine, webcam modeling is allowed provided it contains no explicit performances; in other parts of the world commercial webcamming is banned as a form of pornography.\nDisseminating pornography to a minor is generally illegal. There are various measures to restrict minors' any access to pornography, including protocols for pornographic stores.\n\nPornography can infringe into basic human rights of those involved, especially when sexual consent was not obtained. Revenge porn is a phenomenon where disgruntled sexual partners release images or video footage of intimate sexual activity of their partners, usually on the Internet, without authorization or consent of the individuals involved. In many countries there has been a demand to make such activities specifically illegal carrying higher punishments than mere breach of privacy, or image rights, or circulation of prurient material. As a result, some jurisdictions have enacted specific laws against \"revenge porn\".\n\n\n=== What is not pornography ===\nIn the US, a July 2014 criminal case decision in Massachusetts — Commonwealth v. Rex, 469 Mass. 36 (2014), made a legal determination as to what was not to be considered \"pornography\" and in this particular case \"child pornography\". It was determined that photographs of naked children that were from sources such as National Geographic magazine, a sociology textbook, and a nudist catalog were not considered pornography in Massachusetts even while in the possession of a convicted and (at the time) incarcerated sex offender.\nDrawing the line depends on time, place and context. Occidental mainstream culture has been increasingly getting \"pornified\" (i.e. influenced by pornographic themes, with mainstream films often including unsimulated sexual acts). Since the very definition of pornography is subjective, material that is considered erotic or even religious in one society may be denounced as pornography in another. When European travellers visited India in the 19th century, they were dismayed at the religious representation of sexuality on the Hindu temples and deemed them as pornographic. Similarly many films and television programs that are unobjectionable in contemporary Western societies are labeled as \"pornography\" in Muslim societies. Thus, assessing a material as pornography is very much personalized; to rehash a cliché, \"pornography is very much in the eye of the beholder\".\n\n\n=== Copyright status ===\nIn the United States, some courts have applied US copyright protection to pornographic materials. Some courts have held that copyright protection effectively applies to works, whether they are obscene or not, but not all courts have ruled the same way. The copyright protection rights of pornography in the United States has again been challenged as late as February 2012.\n\n\n== STIs prevention and safer sex practices ==\n\nPerformers working for pornographic film studios undergo regular testing for sexually transmitted infections (STIs) every two weeks. They have to test negative for: HIV, trichomoniasis, chlamydia, gonorrhea, syphilis, and hepatitis B and C before showing up on a set and are then inspected for sores on their mouths, hands, and genitals before commencing work. The industry believes this method of testing to be a viable practice for safer sex as its medical consultants claim that since 2004, about 350,000 pornographic scenes have been filmed without condoms and HIV has not been transmitted even once because of performance on set. However, some studies suggest that adult film performers have high rates of chlamydia and/or gonorrhea infection, and many of these cases may be missed by industry screening because these bacteria can colonize many sites on the body.\nIn the initial years, studios assessed performers suitability on the results from their blood and urine tests. According to a 2019 study by the American College of Emergency Physicians, swab tests offer better insight than urine samples for detecting bacterial STIs like chlamydia and gonorrhea. Performers such as Cherie DeVille have emphasized swab tests for safer sex. According to performer Angela White, studios will not allow them to work unless they are completely clean, insisting on performers testing regularly, she said \"So for me, because I work so much, I’m testing every 12 days – and that is a full sweep of STIs such as chlamydia, gonorrhoea, syphilis, HIV and trichomoniasis. We’re doing throat swabs, vaginal swabs and anal swabs.\" Allan Ronald, a Canadian doctor and HIV/AIDS specialist who did groundbreaking studies on the transmission of STIs among prostitutes in Africa, said there's no doubt about the efficiency of the testing method, but he felt a little uncomfortable: \"because it's giving the wrong message — that you can have multiple sex partners without condoms — but I can't say it doesn't work.\"\nRelatedly, it has been found that individuals who received little sex education and/or perceive pornography as a source of information about sex, are less apt to use condoms in their own sex life, making themselves more susceptible to contract STIs. In 2020—the US National Sex Education Standards—released recommendations to incorporate \"porn literacy\" to students from grade 6 to 12 as part of sex education in the US.\nVeteran performer and former nurse Nina Hartley, who has a degree in nursing, stated that the amount of time involved in shooting a scene can be very long, and with condoms in place it becomes a painful proposition as their usage is uncomfortable despite the use of lube, causes friction burn, and opens up lesions in the genital mucosa. Advocating the testing method for performers, Hartley said, \"Testing works for us, and condoms work for outsiders.\" \n\n\"We're tested every fourteen days. That is literally twenty-three more times than the average American. If that person makes it to their yearly physical. I have met tons of people that haven't been to the doctor in years. That scares me because they have no idea what their status is.... I don't hook up with people outside of the porn industry because I'm terrified. And I'm not the only one. There's many performers that know: if you go out into the wild, you will come back with something.\" — Ash Hollywood (Porn actress).\n\nEmphasizing that performers in the industry take necessary precautions like PrEP and are at lower risk to contract HIV than most sexually active persons outside the industry, many prominent female performers have vehemently opposed regulatory measures like Measure B that sought to make the use of condoms mandatory in pornographic films. Professional female performers have called the use of condoms on a daily basis at work an occupational hazard as they cause micro-tears, friction burn, swelling, and yeast infections, which altogether, they say, makes them more susceptible to contract STIs.\n\n\n== Views on pornography ==\n\nPornography has been vouched to provide a safe outlet for sexual desires that may not be satisfied within relationships and be a facilitator of sexual fulfillment in people who cannot or do not want to have real-life partners. Pornography is viewed by people in general for various reasons; varying from a need to enrich their sexual arousal, to facilitate orgasm, as an aid for masturbation, learn about sexual techniques, reduce stress, alleviate boredom, enjoy themselves, see representation of people like themselves, know their sexual orientation, improve their romantic relationships, or simply because their partner wants them to.\nPornography is noted for engrossing people \"on more than masturbatory levels\". Aesthetic philosophers argue whether pornographic representations can be considered as expressions of art.\nPornography has been equated with journalism as both offer a view into the unknown or the hidden aspects. French philosopher Michel Foucault remarked that, \"it is in pornography that we find information about the hidden, the forbidden and the taboo\". \nScholars such as Linda Williams, Jennifer Nash, and Tim Dean believe pornography \"is a form of thinking\", comprised with ideas that are way more reflective about sexuality and gender than what the creators or consumers of pornography intend. Pornography has been referred by people as a means to explore their sexuality. People have reported porn being helpful in learning about human sexuality in general. Studies recommend clinical practitioners to use pornography as an instruction aid to show their clients new and alternative sexual behaviors as part of psychosexual therapy. British psychologist, Oliver James, known for his work on 'happiness', stated that \"a high proportion of men use porn as a distraction or to reduce stress ... It serves an anti-depressant purpose for the unhappy.\" British-American novelist, Salman Rushdie opined that pornography presence in society is \"a kind of standard-bearer for freedom, even civilisation\".\nAs per evaluation by medical professionals, pornography can neither be good nor bad as it does not endorse or advocate a single set of values regarding sex. As such, individuals may introspect their own values with regards to sex while evaluating pornography. The relationship between pornography and its audience is found to be complex. While many users reported their use to have had positive effects, others especially women were found to be troubled with body image issues, the cause of which is attributed to the unrealistic image of \"beauty\" that pornography portrays. The increasing prevalence of alleged beauty enhancing procedures such as breast augmentation and labiaplasty among the common populace has been attributed to the popularity of pornography.\nData from pornographic websites regarding the viewing habits of people is studied by academics to analyze the sexual preferences and mating choices. More often men look for women who have larger chest and hips, with a smaller Waist–hip ratio. Women are found to prefer men who are taller, stronger, appear highly masculine, and are in roles that can provide resources while being protective (CEO, doctor, athlete, lawmen).\nStudies on harmful effects of pornography include finding any potential influence of pornography on rape, domestic violence, sexual dysfunction, difficulties with sexual relationships, and child sexual abuse. A longitudinal study had ascertained that pornography use cannot be a perpetrating factor in intimate partner violence. \nA 2020 study that analyzed depictions in video-pornography found that normative sexual behaviors (e.g., vaginal intercourse, fellatio) were the most commonly depicted, while depictions of extreme acts of violence and rape were very rare. There is no clear evidence to assume that pornography is a cause of rape. Several studies conclude that liberalization of porn in society may be associated with decreased rates of rape and sexual violence, while others have suggested no effect, or are inconclusive. No correlation has been found between pornography use and the practice of sexual consent or lack thereof.\nMental health experts are divided over the issue of pornography use being a problem for people. While some literature reviews suggest pornography use can be addictive, insufficient evidence exists to draw conclusions. According to clinical psychologist and certified sex therapist David Ley, calling pornography an \"addiction\" has been \"an area of substantial, protracted controversy and debate\". Ley explained pornography doesn't effect an adult brain or body in the way alcohol or drugs do, he said \"An alcoholic going cold turkey can have seizures and die because their brain has become physiologically dependent on the alcohol, but no one has ever had seizures or died from not getting to watch porn when they want to.\" Scholars note that pornography use has no implication on public health as it does not meet the definition of a public health crisis.\nNeuroscience has noted that minds of the young are in developmental stages and exposure to emotionally charged material such as pornography would likely have an impact on them unlike on adults, and has suggested caution while enabling potential access to such material. Opposition to pornography use is associated with sexual satisfaction, gender violence, and marital quality (wives watching pornography more frequently scored much better than the rest). Some issues of doxing and revenge porn had been linked to a few pornography websites. Since the mid-2010s deepfake pornography has become an issue of concern.\n\n\n=== Feminist outlook ===\n\nFeminist movements in the late 1970s and 1980s dealt with the issues of pornography and sexuality in debates that are referred to as the \"sex wars\". While some feminist groups seek to abolish pornography believing it to be harmful, other feminist groups oppose censorship efforts insisting it is benign. A large scale study of data from the General Social Survey (2010–2018) refuted the argument that pornography is inherently anti-woman or anti-feminist and that it drives sexism. The study did not find a relationship between \"pornography viewing\" and \"pornography tolerance\" with higher sexism—a posit that was held by some feminists; it instead found higher pornography consumption and pornography tolerance among men to be associated with their greater support for gender equality. The study concluded that \"pornography is more likely to be about the sex rather than the sexism\".\nPeople who supported regulated pornography expressed lesser attitudes of sexism than people who sought to abolish pornography. Notably, non-feminists are found more likely to support a ban on pornography than feminists. Many feminists, both male and female, have reflected that the effects of pornography on society are neutral. Adult users of pornography were found more egalitarian than nonusers, they are more likely to hold favorable attitudes towards women in positions of power and in workplaces outside home than the nonusers.\n\n\n==== Criticism ====\nA 2016 study authored by Black feminists criticized the American adult entertainment industry for alleged omission and exclusion of Black women in pornographic representations, particularly in the interracial genres. As pornography becomes a kind of manual on how bodies in pleasure can look, and is \"one of the few places where we see our bodies--and other people's bodies,\" it becomes imperative on pornography to represent \"variety of forms\", stated the feminist scholars. Anti-pornography feminists argue that aesthetics of pornography demote Black women with undertones of racism. Gender studies scholars Mireille Miller-Young and Jennifer Christine Nash, in their writings on intersectionality of race and pornography, noted that Black people have been depicted as being hypersexual and Black women—more objectified. The scholars also noted major discrepancies in pay rates of the performers, White women have historically made 75 percent more per scene and sometimes still make 50 percent more compared to Black women.\nFeminist resentment about pornography tend to focus on two concerns: that pornography depicts violence and aggression, and that pornography objectifies women. Multiple analyses of pornographic videos found that Women have been overwhelmingly at the receiving end of aggression from male performers; with the reaction of Women being either positive or neutral towards aggression, which is at odds considering a report that found only 14.2% of US adult women find pain during sex as appealing. Two studies in the 1990s found that Black women were the targets of aggression and faced more violence from both Black and White men than did White women. However, more recent research from 2018 found that Black women were the least likely group of women to suffer nonconsensual aggression and are more likely to receive affection from their male partners. While Black men engaged in fewer intimate behaviors than White men; White women were found more likely to experience violence during sexual activity with White men than with Black men.\nConcerning Asian women, a 2016 study based on a sample of 3053 videos from Xvideos.com, found that in the 170 videos of the Asian women category, there was much less aggression, less objectification, but also the women had less agency. However, another study found that in a sample of 172 videos from Pornhub, the 25+ videos of the Asian/Japanese category had considerably more aggression than those of other categories. A 2002 study of \"internet rape sites\" found that among the 56 clear pictures they found, 34 had Asian women, and nearly half the sites had either an image or a text reference to an Asian woman. Findings on depictions of Asian women in pornography aren't consistent in scientific literature.\nThe prevalence of aggression in pornography appears to be changing. A 2018 study of popular videos on Pornhub found that segments of aggression towards women are fewer now, and they have reduced gradually over the past decade with viewers preferring content where women genuinely experience pleasure.\n\n\n==== Anti-pornography ====\n\nProminent anti-pornography feminists such as Andrea Dworkin and Catharine MacKinnon argue that all pornography is demeaning to women, or that it contributes to violence against women–both in its production and in its consumption. The production of pornography, they argue, entails the physical, psychological, or economic coercion of the women who perform in it. They charged that pornography eroticizes the domination, humiliation, and coercion of women, while reinforcing sexual and cultural attitudes that are complicit in rape and sexual harassment.\nOther sex work exclusionary feminists have insisted that pornography presents a severely distorted image of sexual consent, and it reinforces sexual myths like: women are readily available–and desire to engage in sex at any time–with any man–on men's terms–and always respond positively to men's advances.\n\n\n==== Pro-pornography ====\nIn contrast to the objections, other feminist scholars \"ranging from Betty Friedan and Kate Millett to Karen DeCrow, Wendy Kaminer and Jamaica Kincaid\" have supported the right to consume pornography.\nThe anti-porn feminist stranglehold began to loose when sex-positive feminists like Susie Bright, performers Nina Hartley, and Candida Royalle affirmed the rights of women to consume and produce porn.\nThe works of Camille Paglia established that westerners have been \"pagan celebrants\" for long and pornography has been an inseparable part of western culture. Wendy McElroy has noted that both feminism and pornography are mutually related, with both thriving in environments of tolerance, and both repressed anytime regulations are placed on sexual expression.\nSocieties where pornography and sexual expression is prohibited are more likely to be the places where women are often subjected to violence and sexual abuse.\n\n\n==== Rise of feminist pornography ====\nThe lesbian feminist movement of the 1980s is considered a seminal moment for the women in porn industry as more women entered into the developmental side, allowing women to gear porn more towards women as they knew what women wanted, both from the perspective of actresses as well as the female audience. This involved making lesbian pornography that is not merely geared towards heterosexual males—a change considered good, as for a long time the porn industry had been directed by men for men. \nFurthermore, the advent of the VCR, Home video, and affordable Video cameras allowed for the possibility of feminist pornography. Feminist porn directors are interested in challenging representations of men and women, as well as in providing sexually-empowering imagery that features many kinds of bodies. Angela White started her own production company, AWG Entertainment, in which she has complete creative control over the content—from her partners, to the location, costumes, and the \"vibe\" of the video, \"I am a feminist, so what I create is feminist, and I produce ethical porn, which is when everything is consensual\", she said.\nWomen are more likely to consume porn that is \"female-centered\" and feature acts such as cunnilingus, a study of pornographic videos found that when men spend more time performing cunnilingus they have higher volumes of ejaculate, an increase in sexual arousal resulting from exposure to the vaginal secretion 'copulins' during cunnilingus is reasoned to be the cause. Female-centric porn is mostly made by women, in these works the initiation of sexual activity is done by the female. Porn for women is identified by factors like greater attention on \"sensual surroundings\" and \"soft focus camerawork\", rather than on explicit depiction of sexual activity, making the productions more warm and humane compared to the traditional porn made for hetrosexual men. \n\n\"If feminists define pornography, per se, as the enemy, the result will be to make a lot of women ashamed of their sexual feelings and afraid to be honest about them. And the last thing women need is more sexual shame, guilt, and hypocrisy—this time served up by feminism\" — Ellen Willis.\n\n\n==== Pay rates ====\nPorn industry has been noted for being one of the few industries where women enjoy a power advantage in the workplace. \"Actresses have the power,\" Alec Metro, one of the men in line, ruefully noticed of the X-rated industry. A former firefighter who claimed to have lost a bid for a job to affirmative action, Metro was already divining that porn might not be the ideal career choice for escaping the forces of what he called \"reverse discrimination\". Female performers can often dictate which male actors they will and will not work with. Porn—at least, porn produced for a heterosexual audience—is one of the few contemporary occupations where the pay gap operates in the favor of women. The average actress makes fifty to a hundred per cent more money than her male counterpart.\n\n\n=== Psychological perspective ===\nPsychologists consider pornography to be of particular relevance in the study of intimate relationships and the development of adolescent sexuality. Mainstream psychology is mostly concerned with the study of effects of pornography, while critical psychology and applied psychology is engaged in more nuanced and academic study of pornography. Problematic pornography use is assessed in clinical psychology.\nA 2013 study refuted the notion that porn actresses have higher rates of psychological problems than regular women. The study compared 177 porn actresses with regular women of similar age, ethnicity, and marital status, and found that the porn actresses had \"higher levels of self-esteem, positive feelings, social support, sexual satisfaction, and spirituality\" compared to the regular women.\n\n\n==== Psychoanalyst views ====\nIn analytical psychology, human sexual instincts and religious-spiritual instincts are considered tightly associated with each other, with both sharing a common instinctual objective, which, as Carl Jung acknowledged, is the striving of the psyche for \"wholeness\". The psyche of a person is understood to be differentiated, as being made-up of psychological traits that are feminine and masculine in nature. According to Jung, this differentiation allowed the formation of opposite polarities, which made \"consciousness possible\". According to psychologist and author Giorgio Tricarico, as an individual moves through various life experiences, their psyche approaches wholeness or the state of \"non-differentiated\"—a realm of unified, impersonal consciousness—considered belonging to the sacred or divine. In Hindu cosmological view, the universe is weaved from the two coexisting generative principles: feminine and masculine. Men and women, in whatever form they appear, are considered microcosmic representatives, or mirrors of the macrocosmic energies of Shiva and Shakti. The Goddess or Shakti (spirit, feminine principle) is the \"pure consciousness\", the animating energy or power underlying existence. Shakti, embraced by Shiva (matter, masculine principle), both together in \"perpetual union\" form the nondual \"Absolute\".\n\nShiva and Shakti in a state of \"copulation\" represent the flow of \"erotic energy\" in an individual. Sigmund Freud called the feminine Shakti \"libido that cannot be simply repressed.\" Self-realization or becoming aware of one's \" 'deep' femininity\" entails dealing with the powerful sexual energy. Schools of religious thought such as the Kundalini yoga and Tantra, which involve using the sexual energy for purpose of self-realization had been developed in India. The concept of gender had been studied in Hinduism for long, where the conclusion was arrived that the human self, an emanation from the nondual Absolute—is androgynous, and is encased in human bodies, which themselves are androgyne in the sense that every body is a compound of the feminine (spirit) and the masculine (matter) principles. Sexuality is considered a creative function of nature to align the two principles with the nondual Absolute. The masculine and the feminine principles of the self have been identified to the deities Shiva and Shakti, who make-up the two sexual polarities; by establishing a connection between the two, for the flow of erotic energy (as in the case of an electric circuit between positive and negative terminals for the flow of electric current), in one's own being—by the means of sexual stimulation—through \"erotic visualization\" or \"ritual copulation\", the self would \"divest\" from its body identity and realign into the \"bipolar being\", which, then represents a unit microcosm mirroring the nondual macrocosm; thus an individual in being one with the absolute experiences bliss-considered as the power of the goddess (Shakti) in a tangible form. The Hindu tantric idea of the feminine and masculine principles arriving at unity in the \"divine feminine\" or the \"unified divine consciousness\" is analogous to the Analytical psychology idea of \"coincidentia oppositorum\", wherein the Anima/animus of an individual unite with the \"spirit\" to become one or whole.\nIn the Hindu tantric view, the women who participate in union rituals, thereby enabling men to attain self-realization are regarded as shakti or the goddess, as they are believed to embody her. Recognition of the deity in an objective woman is centered upon a man's acceptance of the subjective feminine and the primacy of her desires. Tricarico professed that modern-day pornography in its essence is a \"desacralised, technological, and consumerist\" equivalent of the ancient sacred prostitution – a custom that involved honoring of the sacred feminine and worship of the prostitutes as goddess. The feminine is believed to embody particular qualities of the sacred or divine more broadly and deeply than the masculine, consequently in women, the ability to incorporate nondualistic awareness is assumed to be higher. Tricarico argued that women in porn, through their performances of many sexual acts, would inadvertently approach the non-differentiated state, an effect which he called the \"intimation of hierophany\". \"Porn actresses may embody the medium to enter what used to be the realm of the sacred\", he said. The actresses have been likened to the \"descendants of the lost goddesses\" who are now offering the gift of the \"numinous\" to all through their performances, but are unacknowledged or devalued for their contributions.\nThe use of epithets like \"bitch\", \"whore\", \"slut\" for sexually active women has been attributed to the denial of the subjective feminine by men. The subdued acceptance of female sexuality, as a value in its own right, is manifested when a man's admiration for the \"bitch\" gets subtended if she happens to be his wife or girlfriend. Along with showing \"admiration, lust, gratitude, and desire\", men show brazen hate and disgust towards women, this behavioral dichotomy had been ascribed to the \"patriarchal hypocrisy\" embedded in men. The unconscious perception by men of the greater ability in women to reach the undifferentiated state of psyche is reasoned to be a cause for their intentional humiliation, wilful devaluation, and deliberate belittlement of women.\nAccording to Julia Kristeva, a psychoanalyst scholar, the psychological rejection and fear of the mother figure in males is the root cause for their behaviors that seek to subjugate women. Men in their infancy live in a state of \"undifferentiated physical and psychic fusion\" with the mother, experiencing \"emotional exhilaration and jouissance\". However, as they mature, sensing their separateness from the mother, they seek to become independent subjects and take recourse to paternal images and patriarchal behaviors with the hope of eliminating any possible further \"undifferentiated/psychotic fusion\" with the mother as they feel threatened by it. According to psychoanalyst Melanie Klein, the rejection and fear of the maternal image, in females, leads them to reject their own femininity. Tricarico hoped that porn becomes a place where men discard patriarchal antics, women embrace the sacred aspects, and audience incorporate porn as a joyful experience for the body – a genuine form of play that helps them approach the non-differentiated state. In being with other, we differentiate ourselves, and experience jouissance whilst becoming a unit being.\n\n\n=== Religious attitudes ===\n\nMany religions have long and vehemently opposed a wide range of sexual behaviors, as a result religious people are found highly susceptible to experience great distress in their use of pornography. Religious people who use pornography tend to feel sexually ashamed. Sexual shame—which arises from a person's perception of their self in other peoples mind, and a negative assessment of their own sexuality—is considered a powerful factor that over time governs an individual's behavior. As sexuality is interwoven into one's personal identity, sexual shame or sexual embarrassment are found to attack the person's very sense of self.\nWhen a sexual shaming event occurs, the person attributes causation to oneself resulting in self condemnation, and experience feelings of sadness, loneliness, anger, unworthiness, and rejection, along with a perceived judgment of their self by others. In this mental landscape, a fear arises that ones sexual self needs to be hiden. This psychological process initiates and fuels further shame and lowers one's self-esteem. Sexual shame constricts the \"psychic space for free play with one's sexuality\". Sexual shame in people begets more shame, and leads to a cycle of powerlessness culminating in deepening negative emotions. Those who tend to feel shame easily are found to be at greater risk for depression and anxiety disorders. According to clinical psychologist Gershen Kaufman, all Sexual disorders are majorly \"disorders of shame\".\nThe cause of attributing shame to sexuality is traced back to the biblical interpretation of nakedness being shameful. Much of the Christian mythology presented sexuality as an obstacle to be surmounted in the way of salvation. The major abrahamic religions condemn and consider all forms of nonmarital and nonreproductive sexual pleasure as unacceptable. In Hinduism, bhoga (sexual pleasure) is celebrated as a value in itself and is considered one of the two ways to nirvana, the other being the more demanding yoga. A central concept in Hinduism, purushartha, advocates pursuit of the four main goals for happiness: dharma (virtue), artha (riches), kama (pleasure), and moksha (freedom). The pursuit of Kama was elaborated by the sage Vatsyayana in his treatise Kama Sutra, which states that sexual pleasure and food are essential for the well-being of the body, and on both of them depend virtue and prosperity. Food, despite causing indigestion sometimes, would still be consumed regularly, and so it must be with pleasure, which must be pursued with caution while eliminating unwanted or harmful effects. As no one abstains from cooking food worrying about beggars who ask for it, or restrain from sowing wheat fearing animals that destroy the crop, similarly, instructs Vatsyayana, that men and women acquire knowledge of Kama by the time they reach youth and pursue it even though dangers exist; and those who become accomplished in Dharma, Artha, and Kama would attain highest happiness in this world and hereafter.\nAccording to the Buddha, happiness is of two types: one derived from \"domestic life\" and the other from \"monastic life\", and between the two, monastic kind is \"superior\". As a result of the Buddha's effective advocacy for monasticism, in Buddhist communities, marriage and divorce remained civil matters and never acquired sacremental significance. Counsel over sex life for householders was minimal, while for the monks it was extensive as in Vinaya since all sexual behaviors were meant to be suppressed for the sake of enlightenment. The early Buddhist texts castigated women as detrimental beings. The Buddha himself said often that a woman's body is \"a vessel of impurity, full of stinking filth. It is like a rotten pit ... like a toilet, with nine holes pouring all sorts of filth.\" Once when it came to his notice that a monk, Suddina, transgressed celibacy with his wife for the sake of progeny, the Buddha chided him saying, \"It were better for you, foolish man, that your male organ should enter the mouth of a terrible and poisonous snake, than that it should enter a woman.\" Per the Buddha, all sexual desires are incompatible with enlightenment. In Buddhism, people who even derive pleasure from watching others engage in sexual activity were relegated as pandaka (pusillanimous). The Buddha said sexuality is a fetter that must be evaded completely and men who engage with it are \"impure\" and will not be freed from \"old age\". After the Buddha died in old age, subsequent generations of Buddhists resolved their problematic attitudes towards sex by accommodating different views.\n\nAccording to Indonesia's foremost Islamic preacher, Abdullah Gymnastiar, shame is a noble emotion commanded in the Quran and was held high by Muhammad, who had been quoted as saying \"Faith is compiled of seventy branches... and shame is one of them.\" To cultivate shame in Muslims, their sexual gaze needs to be checked, as unchecked gaze is believed to be the door through which Satan enters and soils the heart. In 2006, when anti-pornography protests erupted in Indonesia, the world's most populous Muslim-majority country, over the publication of the inaugural Indonesian edition of Playboy – Abdullah called for a legislation to ban pornography and embarked on a mission to shroud the state with a sense of shame, giving the slogan \"the more shameful, the more faithful\". During these protests, Indonesia's foremost Islamic newspaper, Republika, published daily front-page editorials which featured a logo of the word pornografi crossed out with a red X. The Jakarta office of Playboy Indonesia was ransacked by the members of Islamic Defenders Front (Front Pembela Islam or FPI), and bookstore owners were threatened not to sell any issue of the magazine. Consequently, in December 2008, Indonesian lawmakers signed an anti-pornography bill into law with overwhelming political support.\nHighly religious people are more likely to support policies against pornography such as censorship. Ironically, regions with highly religious and conservative people were found to search for more pornography online. Religious people are prone to having obsessive thoughts regarding sin and punishment by God over their pornography use causing them to feel ashamed, and perceive themselves to have pornography addiction while also suffering from OCD related symptoms. A study of sexually active religious people found those who are highly spiritually matured have less shame, while those not spiritually matured have high shame.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Works cited ===\n\n\n== External links ==\n\n The dictionary definition of pornography at Wiktionary\n Quotations related to Pornography at Wikiquote",
  "summary": "Pornography (colloquially called porn or porno) is sexually suggestive material, such as a picture, video, text, or audio, intended for sexual arousal. Made for consumption by adults, pornographic depictions have evolved from cave paintings, some forty millennia ago, to modern-day virtual reality presentations. A general distinction of adults-only sexual content is made, classifying it as pornography or erotica.\nThe oldest artifacts considered pornographic were discovered in Germany in 2008 and are dated to be at least 35,000 years old. Human enchantment with sexual imagery representations has been a constant throughout history. However, the reception of such imagery varied according to the historical, cultural, and national contexts. The Indian Sanskrit text Kama Sutra (3rd century CE) contained prose, poetry, and illustrations regarding sexual behavior, and the book was celebrated; while the British English text Fanny Hill (1748), considered \"the first original English prose pornography,\" has been one of the most prosecuted and banned books. In the late 19th century, a film by Thomas Edison that depicted a kiss was denounced as obscene in the United States, whereas Eugène Pirou's 1896 film Bedtime for the Bride was received very favorably in France. Starting from the mid-twentieth century on, societal attitudes towards sexuality became lenient in the Western world where legal definitions of obscenity were made limited. In 1969, Blue Movie by Andy Warhol became the first film to depict unsimulated sex that received a wide theatrical release in the United States. This was followed by the \"Golden Age of Porn\" (1969–1984). The introduction of home video and the World Wide Web in the late 20th century led to global growth in the pornography business. Beginning in the 21st century, greater access to the Internet and affordable smartphones made pornography more mainstream.\nPornography has been vouched to provision a safe outlet for sexual desires that may not be satisfied within relationships and be a facilitator of sexual fulfillment in people who do not have a partner. Pornography consumption is found to induce psychological moods and emotions similar to those evoked during sexual intercourse and casual sex. Pornography usage is considered a widespread recreational activity in-line with other digitally mediated activities such as use of social media or video games. People who regard porn as sex education material were identified as more likely not to use condoms in their own sex life, thereby assuming a higher risk of contracting sexually transmitted infections (STIs); performers working for pornographic studios undergo regular testing for STIs unlike much of the general public. Comparative studies indicate higher tolerance and consumption of pornography among adults tends to be associated with their greater support for gender equality. Among feminist groups, some seek to abolish pornography believing it to be harmful, while others oppose censorship efforts insisting it is benign. A longitudinal study ascertained pornography use is not a predictive factor in intimate partner violence. Porn Studies, started in 2014, is the first international peer-reviewed, academic journal dedicated to critical study of pornographic \"products and services\".\nPornography is a major influencer of people's perception of sex in the digital age; numerous pornographic websites rank among the top 50 most visited websites worldwide. Called an \"erotic engine\", pornography has been noted for its key role in the development of various communication and media processing technologies. For being an early adopter of innovations and a provider of financial capital, the pornography industry has been cited to be a contributing factor in the adoption and popularization of media related technologies. The exact economic size of the porn industry in the early twenty-first century is unknown. In 2023, estimates of the total market value stood at over US$172 billion. The legality of pornography varies across countries. People hold diverse views on the availability of pornography. From the mid-2010s, unscrupulous pornography such as deepfake pornography and revenge porn have become issues of concern.",
  "references": [
    "http://www.macworld.com/news/2006/05/02/pornhd/index.php?lsrc=mwrss",
    "http://networkcultures.org/wpmu/netporn/extras/abstract/",
    "http://www.timesonline.co.uk/tol/news/uk/article466971.ece",
    "http://www.ipbrief.net/2012/02/16/4803/",
    "http://www.libidomag.com/nakedbrunch/archive/europorn07.html",
    "http://www.victorian-cinema.net/lear.htm",
    "http://www.victorian-cinema.net/pirou.htm",
    "http://www.time.com/time/columnist/corliss/article/0,9565,1043267,00.html",
    "http://business.avn.com/articles/technology/Magnet-Media-Holds-Porn-Tech-Event-in-NYC-This-Tuesday-551837.html",
    "http://business.avn.com/articles/legal/MA-Supremes-Rule-National-Geographic-Photos-Not-Kid-Porn-566486.html",
    "http://business.avn.com/articles/technology/Adult-Tube-Sites-Now-Spamming-Through-Google-News-368393.html",
    "http://business.avn.com/articles/legal/Nightline-Takes-a-Look-at-Porn-Piracy-and-Targets-MindGeek-556480.html",
    "http://business.avn.com/company-news/Takedown-Piracy-Celebrates-Fifth-Anniversary-560384.html",
    "http://business.avn.com/articles/video/The-Truth-About-California-s-Adult-Entertainment-Industry-White-Paper-1999-35686.html",
    "https://web.archive.org/web/20010609221146/http://www.forbes.com/2001/05/25/0524porn.html",
    "https://books.google.com/books?id=vhSHn-B89A0C&pg=PA195",
    "https://web.archive.org/web/20060712001523/http://www.macworld.com/news/2006/05/02/pornhd/index.php?lsrc=mwrss",
    "https://web.archive.org/web/20070621131847/http://www.theinquirer.net/en/inquirer/news/2007/01/17/blu-ray-loves-porn-after-all",
    "https://web.archive.org/web/20070210100959/http://www.foxnews.com/story/0,2933,245638,00.html",
    "https://www.psychologytoday.com/blog/evolution-the-self/201104/what-distinguishes-erotica-pornography",
    "https://www.theguardian.com/books/booksblog/2013/may/02/porn-studies-new-discipline-academics",
    "https://www.theguardian.com/world/2006/apr/12/gender.politicsphilosophyandsociety",
    "https://www.theguardian.com/lifeandstyle/2014/jun/06/teledildonics-interactive-porn-sex-in-digital-age",
    "https://www.nytimes.com/movie/review?res=9507E5D91738E63ABC4A51DFB1668382679EDE",
    "https://query.nytimes.com/gst/abstract.html?res=9807E4D91739EF3BBC4852DFBE668382679EDE",
    "https://www.forbes.com/2001/05/25/0524porn.html",
    "https://www.independent.co.uk/news/world/sex-trade-moguls-thrive-by-the-blue-danube-1329695.html",
    "https://www.pbs.org/thinktank/transcript215.html",
    "https://www.pbs.org/wgbh/pages/frontline/shows/porn/",
    "https://d-nb.info/gnd/4046809-4",
    "https://web.archive.org/web/20141219160919/http://www.slate.com/articles/technology/technology/2014/10/mindgeek_porn_monopoly_its_dominance_is_a_cautionary_tale_for_other_industries.html",
    "http://www.slate.com/articles/technology/technology/2014/10/mindgeek_porn_monopoly_its_dominance_is_a_cautionary_tale_for_other_industries.html",
    "https://www.nbcnews.com/business/business-news/things-are-looking-americas-porn-industry-n289431",
    "https://psmag.com/environment/surprise-we-all-love-porn",
    "https://catalog.archives.gov/id/10643026",
    "https://www.bbc.com/news/technology-30307657",
    "https://web.archive.org/web/20051108034758/http://www.fanny-hill.net/html/o1a_danish_pornography_laws.htm",
    "https://catalogue.bnf.fr/ark:/12148/cb12647536c",
    "http://archive.boston.com/yourlife/articles/2006/01/24/the_pornification_of_america/",
    "https://data.bnf.fr/ark:/12148/cb12647536c",
    "https://archive.org/details/dailylifeinancie00neme/page/137",
    "https://hls-dhs-dss.ch/fr/articles/016561",
    "https://archive.org/details/partingdesertcre00kara/page/195",
    "https://www.vice.com/en_us/article/j5yzpk/they-cant-stop-us-people-are-having-sex-with-3d-avatars-of-their-exes-and-celebrities",
    "https://www.nytimes.com/2017/10/28/style/virtual-reality-porn.html",
    "https://www.independent.co.uk/life-style/gadgets-and-tech/news/pornography-porn-virtual-reality-personal-intimate-vr-headset-criticism-problems-a8046141.html",
    "https://archive.org/details/womeninancienteg00robi",
    "https://www.dir.ca.gov/dosh/adultfilmindustry.html",
    "https://www.netflix.com/title/80038162",
    "https://www.vice.com/en_us/article/mb8zjn/pornhub-doxing-and-harassment-girls-do-porn-lawsuit",
    "https://www.vice.com/en_ca/article/epgpqa/how-to-remove-videos-from-pornhub",
    "https://www.bustle.com/p/notyourporn-is-the-campaign-fighting-to-get-non-consensual-content-removed-from-uk-porn-sites-18669297",
    "https://web.archive.org/web/20181110120126/http://archive.boston.com/yourlife/articles/2006/01/24/the_pornification_of_america/",
    "https://books.google.com/books?id=05LXAAAAMAAJ&q=Inana",
    "https://api.semanticscholar.org/CorpusID:146523196",
    "https://api.semanticscholar.org/CorpusID:145460606",
    "https://api.semanticscholar.org/CorpusID:143713545",
    "https://www.wikidata.org/wiki/Q291#identifiers",
    "https://books.google.com/books?id=LbqF8z2bq3sC&q=devil+poseidon+pan&pg=PA264",
    "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.04.0057:entry=pornogra/fos",
    "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:2008.01.0405:casaubonpage%3D567b",
    "http://id.worldcat.org/fast/1071875/",
    "https://books.google.com/books?id=1frADwAAQBAJ&pg=PT102",
    "https://books.google.com/books?id=N70GiNB8aQ4C&pg=PA458",
    "https://books.google.com/books?id=JLzWDAAAQBAJ&pg=PA92",
    "https://books.google.com/books?id=WX1DAAAAQBAJ&pg=PA148",
    "https://archive.today/20120524121526/http://www.time.com/time/arts/article/0,8599,1043267,00.html",
    "https://web.archive.org/web/20150709041905/http://www.fiawol.demon.co.uk/FAC/harm.htm",
    "https://books.google.com/books?id=iP4sA3kwcFsC&pg=PT94",
    "http://www.fiawol.demon.co.uk/FAC/harm.htm",
    "https://api.semanticscholar.org/CorpusID:24115571",
    "https://books.google.com/books?id=PYoBEAAAQBAJ&dq=Le+Coucher+de+la+Mari%C3%A9e+popular&pg=PA168",
    "https://web.archive.org/web/20081012201204/http://www.timesonline.co.uk/tol/news/uk/article466971.ece",
    "https://aleph.nkp.cz/F/?func=find-c&local_base=aut&ccl_term=ica=ph124363&CON_LNG=ENG",
    "https://cnn.com/2009/LIVING/personal/07/24/o.women.watching.porn/",
    "https://web.archive.org/web/20131106104837/http://people.hbs.edu/bedelman/papers/redlightstates.pdf",
    "https://web.archive.org/web/20130131060438/http://www.nouvelles.umontreal.ca:80/udem-news/news-digest/are-the-effects-of-pornography-negligible.html",
    "http://www.nouvelles.umontreal.ca:80/udem-news/news-digest/are-the-effects-of-pornography-negligible.html",
    "https://api.semanticscholar.org/CorpusID:145125342",
    "https://api.semanticscholar.org/CorpusID:145395436",
    "http://people.hbs.edu/bedelman/papers/redlightstates.pdf",
    "https://www.huffpost.com/entry/internet-porn-stats_n_3187682",
    "https://web.archive.org/web/20100625020708/http://www.cbsnews.com/8301-503544_162-20003319-503544.html",
    "http://www.cbsnews.com/8301-503544_162-20003319-503544.html",
    "https://www.nytimes.com/2012/11/06/health/unlikely-model-for-hiv-prevention-porn-industry.html",
    "https://web.archive.org/web/20220710204546/https://www.nytimes.com/2012/11/06/health/unlikely-model-for-hiv-prevention-porn-industry.html",
    "http://business.avn.com/articles/legal/Adult-Actresses-Deliver-Petitions-to-Isadore-Hall-Office-UPDATED-564968.html",
    "https://web.archive.org/web/20140627081944/http://business.avn.com/articles/legal/Adult-Actresses-Deliver-Petitions-to-Isadore-Hall-Office-UPDATED-564968.html",
    "http://blogs.ocweekly.com/navelgazing/2013/04/tasha_tells_measure_b.php",
    "https://web.archive.org/web/20140222201008/http://blogs.ocweekly.com/navelgazing/2013/04/tasha_tells_measure_b.php",
    "https://news.gallup.com/poll/235280/americans-say-pornography-morally-acceptable.aspx",
    "https://rewirenewsgroup.com/2019/09/27/the-rift-in-the-porn-world-about-how-to-approach-hiv/",
    "https://web.archive.org/web/20221011112002/https://rewirenewsgroup.com/2019/09/27/the-rift-in-the-porn-world-about-how-to-approach-hiv/",
    "https://www.psychologytoday.com/us/blog/sexual-intelligence/201610/kids-need-porn-literacy",
    "https://www.psychologytoday.com/us/blog/love-and-sex-in-the-digital-age/202007/the-evolution-pornography",
    "https://www.tokyoweekender.com/2018/02/the-japanese-porn-industry-5-things-we-learned-at-japan-adult-expo/",
    "https://web.archive.org/web/20220122135259/https://www.tokyoweekender.com/2018/02/the-japanese-porn-industry-5-things-we-learned-at-japan-adult-expo/",
    "https://web.archive.org/web/20151231190855/https://www.nytimes.com/movie/review?res=9507E5D91738E63ABC4A51DFB1668382679EDE",
    "https://web.archive.org/web/20060906164445/http://www.libidomag.com/nakedbrunch/archive/europorn07.html",
    "https://www.theguardian.com/Archive/Article/0,4273,4153718,00.html",
    "https://api.semanticscholar.org/CorpusID:142218966",
    "https://www.nytimes.com/2014/03/29/sunday-review/does-porn-hurt-children.html",
    "http://www.bbc.com/future/story/20170926-is-porn-harmful-the-evidence-the-myths-and-the-unknowns",
    "https://web.archive.org/web/20131126070715/http://aic.gov.au/media_library/publications/proceedings/14/kutchinsky.pdf",
    "http://aic.gov.au/media_library/publications/proceedings/14/kutchinsky.pdf",
    "https://web.archive.org/web/20070206211030/http://www2.hu-berlin.de/sexology/BIB/DIAM/effects_pornography.htm",
    "http://www2.hu-berlin.de/sexology/BIB/DIAM/effects_pornography.htm",
    "https://books.google.com/books?id=QSp2CwAAQBAJ",
    "https://api.semanticscholar.org/CorpusID:149581888",
    "https://api.semanticscholar.org/CorpusID:147808068",
    "https://scholarsarchive.byu.edu/facpub/4420",
    "https://www.independent.co.uk/arts-entertainment/films/hong-kong-filmmakers-shoot-first-3d-porn-film-2048267.html",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8888391",
    "https://doi.org/10.1007%2Fs10508-021-02201-7",
    "https://pubmed.ncbi.nlm.nih.gov/34984569",
    "https://doi.org/10.2105%2FAJPH.2022.307146",
    "https://pubmed.ncbi.nlm.nih.gov/36516393",
    "https://doi.org/10.1080%2F07341510500508610",
    "https://doi.org/10.1111%2Fssqu.12524",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8853281",
    "https://doi.org/10.1007%2Fs10508-021-02175-6",
    "https://pubmed.ncbi.nlm.nih.gov/35165802",
    "https://doi.org/10.3138%2Fcjhs.2019-0065",
    "https://doi.org/10.1080%2F08164649.2011.546332",
    "https://doi.org/10.1007%2Fs10902-009-9175-0",
    "https://doi.org/10.3149%2Fjms.2201.64",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8288831",
    "https://doi.org/10.1007%2Fs10508-021-02077-7",
    "https://pubmed.ncbi.nlm.nih.gov/34282505",
    "https://doi.org/10.1080%2F00224499.2015.1096886",
    "https://pubmed.ncbi.nlm.nih.gov/26683998",
    "https://doi.org/10.1177%2F0743558407306348",
    "https://doi.org/10.1257%2Fjep.23.1.209",
    "https://doi.org/10.1080%2F00224490609552323",
    "https://pubmed.ncbi.nlm.nih.gov/17599247",
    "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2374119",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9252028",
    "https://doi.org/10.1186%2Fs12889-022-13699-4",
    "https://pubmed.ncbi.nlm.nih.gov/35787262",
    "https://doi.org/10.1177%2F1363460714532937",
    "https://doi.org/10.1080%2F10720162.2016.1151391",
    "https://doi.org/10.1007%2Fs10943-018-0732-x",
    "https://pubmed.ncbi.nlm.nih.gov/30465262",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4990495",
    "https://doi.org/10.1111%2Fadd.13297",
    "https://pubmed.ncbi.nlm.nih.gov/26893127",
    "https://doi.org/10.1016%2Fbs.irn.2016.04.002",
    "https://pubmed.ncbi.nlm.nih.gov/27503448",
    "https://doi.org/10.1016%2Fj.neubiorev.2016.08.033",
    "https://pubmed.ncbi.nlm.nih.gov/27590829",
    "https://doi.org/10.2139%2Fssrn.913013",
    "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=913013",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9485786",
    "https://doi.org/10.1007%2Fs12119-022-10011-9",
    "https://pubmed.ncbi.nlm.nih.gov/36157715",
    "https://www.nytimes.com/2015/07/23/world/asia/the-kama-sutra-as-a-work-of-philosophy.html",
    "https://doi.org/10.1111%2Fvar.12105",
    "https://doi.org/10.1080%2F00224499.2020.1864263",
    "https://pubmed.ncbi.nlm.nih.gov/33428456",
    "https://www.scientificamerican.com/article/the-scientific-underpinnings-and-impacts-of-shame/",
    "https://web.archive.org/web/20230213194108/https://www.scientificamerican.com/article/the-scientific-underpinnings-and-impacts-of-shame/",
    "https://web.archive.org/web/20221122225704/https://www.nytimes.com/2014/03/29/sunday-review/does-porn-hurt-children.html",
    "https://doi.org/10.1080%2F00064246.2016.1223484",
    "https://doi.org/10.1080%2F00224499.2015.1023427",
    "https://pubmed.ncbi.nlm.nih.gov/26305435",
    "https://www.science.org/content/article/religious-and-conservative-states-search-more-internet-pornography",
    "https://doi.org/10.1007%2Fs10508-020-01878-6",
    "https://pubmed.ncbi.nlm.nih.gov/33403534",
    "https://api.semanticscholar.org/CorpusID:231586724",
    "https://api.semanticscholar.org/CorpusID:225728859",
    "https://books.google.com/books?id=7LsnAAAAYAAJ",
    "https://api.semanticscholar.org/CorpusID:143660968",
    "https://doi.org/10.1007%2Fs10508-021-02141-2",
    "https://pubmed.ncbi.nlm.nih.gov/34853978",
    "https://api.semanticscholar.org/CorpusID:254262176",
    "https://api.semanticscholar.org/CorpusID:23901098",
    "https://api.semanticscholar.org/CorpusID:152089704",
    "https://api.semanticscholar.org/CorpusID:254265756",
    "https://api.semanticscholar.org/CorpusID:53720632",
    "http://www.theinquirer.net/en/inquirer/news/2007/01/17/blu-ray-loves-porn-after-all",
    "https://www.kristeligt-dagblad.dk/danmark/inge-krogh-er-doed-hun-kaempede-mod-boernepornografi-mens-andre-kaldte-et-forbud",
    "https://jyllands-posten.dk/kultur/ECE12290907/i-11-aar-var-danmark-hele-verdens-boernepornomekka-hvorfor-greb-ingen-ind/",
    "https://web.archive.org/web/20230212025828/http://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.04.0057:entry=pornogra/fos",
    "https://www.etymonline.com/search?q=pornography",
    "https://web.archive.org/web/20220618065521/https://www.etymonline.com/search?q=pornography",
    "https://web.archive.org/web/20221206063327/https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:2008.01.0405:casaubonpage%3D567b",
    "https://www.oed.com/oed2/00184357",
    "https://web.archive.org/web/20210730005442/https://www.oed.com/oed2/00184357",
    "https://web.archive.org/web/20221014063946/https://www.independent.co.uk/news/world/sex-trade-moguls-thrive-by-the-blue-danube-1329695.html",
    "https://web.archive.org/web/20230102111302/https://networkcultures.org/netporn/program/extras/abstract/",
    "https://web.archive.org/web/20130116164054/https://www.google.com/adplanner/static/top1000/",
    "http://www.extremetech.com/computing/123929-just-how-big-are-porn-sites",
    "https://web.archive.org/web/20221206191508/https://www.dir.ca.gov/dosh/adultfilmindustry.html",
    "https://www.amazon.com/Annual-Institute-Telecommunications-Policy-Regulation/dp/B08VRBX6Z3",
    "https://www.science.org/content/article/earliest-pornography",
    "https://web.archive.org/web/20221113161558/https://www.science.org/content/article/earliest-pornography",
    "https://link.springer.com/book/10.1007/978-3-030-37659-8",
    "https://doi.org/10.1007%2F978-3-030-37659-8",
    "https://www.routledge.com/What-Do-We-Know-About-the-Effects-of-Pornography-After-Fifty-Years-of-Academic/Mckee-Litsou-Byron-Ingham/p/book/9781032140315",
    "https://doi.org/10.1097%2FOLQ.0b013e318214e408",
    "https://doi.org/10.1097%2FOLQ.0b013e3182716e6e",
    "https://doi.org/10.1080%2F10410236.2019.1652392",
    "https://doi.org/10.1080%2F0092623X.2018.1462278",
    "https://books.google.com/books?id=r-I4gcBlTqcC",
    "https://books.google.com/books?id=U3rJxPYT32MC",
    "https://books.google.com/books?id=2TP4AAAAQBAJ",
    "https://books.google.com/books?id=8PzitcyG2wsC",
    "https://books.google.com/books?id=W2pgAwAAQBAJ",
    "https://books.google.com/books?id=I7J5LGp42XwC",
    "https://books.google.com/books?id=izUEAQAAIAAJ",
    "https://books.google.com/books?id=Hs6mAgAAQBAJ",
    "https://api.semanticscholar.org/CorpusID:243258192",
    "https://books.google.com/books?id=6qQnlc2RFZYC",
    "https://books.google.com/books?id=RpSBDwAAQBAJ",
    "https://books.google.com/books?id=NburQgAACAAJ",
    "https://books.google.com/books?id=f47qOw2w5Q0C",
    "https://books.google.com/books?id=OVWNBAAAQBAJ",
    "https://books.google.com/books?id=2wqbC17l5iUC",
    "https://books.google.com/books?id=xu0ITwAf7IAC",
    "https://books.google.com/books?id=M30_EAAAQBAJ",
    "https://books.google.com/books?id=udkN4xWi2r0C",
    "https://api.semanticscholar.org/CorpusID:2855793",
    "https://pubmed.ncbi.nlm.nih.gov/23191956",
    "https://api.semanticscholar.org/CorpusID:11721333",
    "https://pubmed.ncbi.nlm.nih.gov/31403326",
    "https://api.semanticscholar.org/CorpusID:199540715",
    "https://pubmed.ncbi.nlm.nih.gov/29634458",
    "https://api.semanticscholar.org/CorpusID:4794350",
    "https://www.google.com/adplanner/static/top1000/",
    "https://web.archive.org/web/20221208113813/http://www.bbc.com/news/magazine-34471653",
    "https://www.bbc.com/news/magazine-34471653",
    "https://www.theguardian.com/culture/2009/dec/09/museums-greece",
    "https://web.archive.org/web/20210918115658/https://www.theguardian.com/culture/2009/dec/09/museums-greece",
    "https://books.google.com/books?id=m1mM0m37AHkC",
    "https://www.nytimes.com/2015/01/19/business/media/as-playboy-and-penthouse-fade-newer-pornographic-magazines-tilt-artistic.html",
    "https://web.archive.org/web/20230226163015/https://www.nytimes.com/2015/01/19/business/media/as-playboy-and-penthouse-fade-newer-pornographic-magazines-tilt-artistic.html",
    "https://www.independent.co.uk/life-style/health-and-families/bone-cancer-symptoms-onlyfans-b2292072.html",
    "https://web.archive.org/web/20230303062528/https://www.independent.co.uk/life-style/health-and-families/bone-cancer-symptoms-onlyfans-b2292072.html",
    "https://www.nytimes.com/2021/05/18/magazine/onlyfans-porn.html",
    "https://web.archive.org/web/20230307004809/https://www.nytimes.com/2021/05/18/magazine/onlyfans-porn.html",
    "https://archive.org/details/kamasutra00vats",
    "https://mashable.com/article/virtual-reality-vr-porn-how-to-watch",
    "https://web.archive.org/web/20230307153724/https://mashable.com/article/virtual-reality-vr-porn-how-to-watch",
    "https://web.archive.org/web/20230305221238/https://www.nytimes.com/2015/07/23/world/asia/the-kama-sutra-as-a-work-of-philosophy.html",
    "https://pubmed.ncbi.nlm.nih.gov/21844714",
    "https://www.theguardian.com/books/shortcuts/2017/aug/14/fanny-hill-ban-university-racy-novel-woman-pleasure",
    "https://web.archive.org/web/20230127161639/https://www.theguardian.com/books/shortcuts/2017/aug/14/fanny-hill-ban-university-racy-novel-woman-pleasure",
    "https://www.cnbc.com/2016/01/20/porns-dirtiest-secret-what-everyone-gets-paid.html",
    "https://web.archive.org/web/20221010212320/https://www.cnbc.com/2016/01/20/porns-dirtiest-secret-what-everyone-gets-paid.html",
    "https://books.google.com/books?id=NRmjRcSYXlgC&q=%22andy+warhol%22+%22blue+movie%22&pg=PA326",
    "https://www.cosmopolitan.com/sex-love/a34642666/racism-porn-industry/",
    "https://web.archive.org/web/20230318065609/https://www.cosmopolitan.com/sex-love/a34642666/racism-porn-industry/",
    "https://books.google.com/books?id=tsYSDgAAQBAJ",
    "https://books.google.com/books?id=W2MkAQAAIAAJ",
    "https://web.archive.org/web/20220104114354/https://www.thetimes.co.uk/article/professor-sir-bernard-williams-6th6hfnkgt7",
    "https://books.google.com/books?id=roC5CgAAQBAJ",
    "https://www.etymonline.com/word/porn#etymonline_v_18480",
    "https://web.archive.org/web/20230402075749/https://www.etymonline.com/word/porn",
    "https://web.archive.org/web/20210224050826/https://avn.com/business/articles/legal/ma-supremes-rule-national-geographic-photos-not-kid-porn-566486.html",
    "https://web.archive.org/web/20230327214739/https://plato.stanford.edu/entries/feminist-sex-markets/",
    "https://plato.stanford.edu/entries/feminist-sex-markets/",
    "https://archive.org/details/introductiontohi0000floo",
    "https://www.britannica.com/topic/pornography",
    "https://web.archive.org/web/20230413154821/https://www.britannica.com/topic/pornography",
    "https://id.loc.gov/authorities/sh85105008",
    "https://www.cambridge.org/core/books/politics-of-immorality-in-ancient-rome/C44A21822086D3C51939E3AAAF5D08DC",
    "https://www.psychologytoday.com/us/blog/all-about-sex/201309/the-real-kama-sutra-more-ancient-sex-manual",
    "https://web.archive.org/web/20110411143549/http://museoarcheologiconazionale.campaniabeniculturali.it/glossario/ploneglossarydefinition.2008-06-09.8351409625/",
    "http://museoarcheologiconazionale.campaniabeniculturali.it/glossario/ploneglossarydefinition.2008-06-09.8351409625/",
    "https://web.archive.org/web/20230305221919/https://www.theguardian.com/lifeandstyle/2014/jun/06/teledildonics-interactive-porn-sex-in-digital-age",
    "http://www.fanny-hill.net/html/o1a_danish_pornography_laws.htm",
    "https://archive.org/details/the-complete-kama-sutra-the-first-unabridged-modern-translation-of-the-classic-i/page/n4/mode/1up?view=theater",
    "https://www.newyorker.com/magazine/1995/10/30/the-money-shot",
    "https://doi.org/10.1037%2F0003-066X.42.10.941",
    "https://www.theguardian.com/law/2012/aug/08/extreme-porn-trial-simon-walsh",
    "https://web.archive.org/web/20151007152049/http://websearch.aic.gov.au/firstaicPublic/fullRecord.jsp?recno=203812",
    "http://websearch.aic.gov.au/firstaicPublic/fullRecord.jsp?recno=203812",
    "https://web.archive.org/web/20081210015947/http://www.justice.gov.uk/news/announcement261108a.htm",
    "http://www.justice.gov.uk/news/announcement261108a.htm",
    "https://www.routledge.com/Sex-For-Sale-Prostitution-Pornography-and-Erotic-Dancing/Weitzer/p/book/9781032133157",
    "https://web.archive.org/web/20171112112040/http://www.nytimes.com/2000/10/23/us/erotica-special-report-technology-sent-wall-street-into-market-for-pornography.html",
    "https://www.nytimes.com/2000/10/23/technology/23PORN.html?ei=5070&en=cf2eac8f093695d5&ex=1199422800&pagewanted=all",
    "https://web.archive.org/web/20160126122520/http://laist.com/2010/02/25/xbiz_awards_1.php#photo-1",
    "http://laist.com/2010/02/25/xbiz_awards_1.php#photo-1",
    "https://web.archive.org/web/20230417080236/https://www.pbs.org/wgbh/pages/frontline/shows/porn/",
    "https://books.google.com/books?id=-cqlAgAAQBAJ",
    "https://doi.org/10.1080%2F23268743.2014.927708",
    "https://au.sports.yahoo.com/supercars-father-staggering-reaction-renee-gracie-porn-205432884.html",
    "https://www.pearson.com/en-us/subject-catalog/p/Rathus-Human-Sexuality-in-a-Changing-World-Books-a-la-Carte-Edition-10th-Edition/P200000003031/9780137533527",
    "https://doi.org/10.1177%2F1060826517728303",
    "https://web.archive.org/web/20230317010626/https://books.google.com/books?id=05LXAAAAMAAJ&q=Inana",
    "https://web.archive.org/web/20230307171303/https://books.google.com/books?id=2TP4AAAAQBAJ",
    "https://web.archive.org/web/20230501091118/https://www.cambridge.org/core/books/politics-of-immorality-in-ancient-rome/C44A21822086D3C51939E3AAAF5D08DC",
    "https://web.archive.org/web/20230307171303/https://books.google.com/books?id=izUEAQAAIAAJ",
    "https://web.archive.org/web/20230404221821/https://books.google.com/books?id=tsYSDgAAQBAJ",
    "https://web.archive.org/web/20230307171303/https://books.google.com/books?id=Hs6mAgAAQBAJ",
    "https://web.archive.org/web/20230224080418/https://link.springer.com/book/10.1007/978-3-030-37659-8",
    "https://web.archive.org/web/20230307171303/https://books.google.com/books?id=6qQnlc2RFZYC",
    "https://web.archive.org/web/20230307171303/https://books.google.com/books?id=RpSBDwAAQBAJ",
    "https://web.archive.org/web/20230224080418/https://www.routledge.com/What-Do-We-Know-About-the-Effects-of-Pornography-After-Fifty-Years-of-Academic/Mckee-Litsou-Byron-Ingham/p/book/9781032140315",
    "https://web.archive.org/web/20230209134103/https://books.google.com/books?id=OVWNBAAAQBAJ",
    "https://web.archive.org/web/20230307171302/https://books.google.com/books?id=2wqbC17l5iUC",
    "https://web.archive.org/web/20230307171302/https://books.google.com/books?id=xu0ITwAf7IAC",
    "https://web.archive.org/web/20230419164505/https://books.google.com/books?id=M30_EAAAQBAJ",
    "https://web.archive.org/web/20230305221621/https://books.google.com/books?id=QSp2CwAAQBAJ",
    "https://web.archive.org/web/20230404221822/https://books.google.com/books?id=W2MkAQAAIAAJ",
    "https://web.archive.org/web/20230531181127/https://www.routledge.com/Sex-For-Sale-Prostitution-Pornography-and-Erotic-Dancing/Weitzer/p/book/9781032133157",
    "https://web.archive.org/web/20230221141055/https://www.amazon.com/Annual-Institute-Telecommunications-Policy-Regulation/dp/B08VRBX6Z3",
    "https://web.archive.org/web/20230405004629/https://books.google.com/books?id=roC5CgAAQBAJ",
    "https://web.archive.org/web/20230211072910/https://scholarsarchive.byu.edu/facpub/4420/",
    "https://web.archive.org/web/20230530164045/https://www.newyorker.com/magazine/1995/10/30/the-money-shot",
    "https://web.archive.org/web/20200524071906/https://www.theguardian.com/books/2001/mar/17/society.martinamis1",
    "https://web.archive.org/web/20210228122332/https://www.extremetech.com/computing/123929-just-how-big-are-porn-sites",
    "https://web.archive.org/web/20190914024318/https://www.bustle.com/p/notyourporn-is-the-campaign-fighting-to-get-non-consensual-content-removed-from-uk-porn-sites-18669297",
    "https://web.archive.org/web/20061010111821/http://www.victorian-cinema.net/lear.htm",
    "https://web.archive.org/web/20120502070425/http://www.victorian-cinema.net/pirou.htm",
    "https://web.archive.org/web/20221204112558/https://www.cnn.com/2009/LIVING/personal/07/24/o.women.watching.porn/",
    "https://web.archive.org/web/20190717230538/http://www.bbc.com/future/story/20170926-is-porn-harmful-the-evidence-the-myths-and-the-unknowns",
    "https://web.archive.org/web/20190716202853/https://www.vice.com/en_us/article/mb8zjn/pornhub-doxing-and-harassment-girls-do-porn-lawsuit",
    "https://web.archive.org/web/20200903060741/https://www.vice.com/en_ca/article/epgpqa/how-to-remove-videos-from-pornhub",
    "https://web.archive.org/web/20131214191637/http://www.theguardian.com/books/booksblog/2013/may/02/porn-studies-new-discipline-academics",
    "https://web.archive.org/web/20200519230551/https://news.gallup.com/poll/235280/americans-say-pornography-morally-acceptable.aspx",
    "https://web.archive.org/web/20210113232936/https://www.independent.co.uk/life-style/gadgets-and-tech/news/pornography-porn-virtual-reality-personal-intimate-vr-headset-criticism-problems-a8046141.html",
    "https://web.archive.org/web/20230607030952/https://au.sports.yahoo.com/supercars-father-staggering-reaction-renee-gracie-porn-205432884.html",
    "https://web.archive.org/web/20140821075237/http://business.avn.com/articles/technology/Adult-Tube-Sites-Now-Spamming-Through-Google-News-368393.html",
    "https://web.archive.org/web/20170820121408/https://psmag.com/environment/surprise-we-all-love-porn",
    "https://web.archive.org/web/20090826173650/http://www.guardian.co.uk/world/2006/apr/12/gender.politicsphilosophyandsociety",
    "https://web.archive.org/web/20230530161042/https://www.theguardian.com/law/2012/aug/08/extreme-porn-trial-simon-walsh",
    "https://web.archive.org/web/20140728100002/http://business.avn.com/articles/legal/Nightline-Takes-a-Look-at-Porn-Piracy-and-Targets-MindGeek-556480.html",
    "https://web.archive.org/web/20210319202454/https://www.nytimes.com/2017/10/28/style/virtual-reality-porn.html",
    "https://web.archive.org/web/20210825011122/https://www.huffpost.com/entry/internet-porn-stats_n_3187682",
    "https://www.mirror.co.uk/news/uk-news/teacher-quits-after-pupils-find-28624048",
    "https://web.archive.org/web/20230430115224/https://www.mirror.co.uk/news/uk-news/teacher-quits-after-pupils-find-28624048",
    "https://web.archive.org/web/20230215065410/https://www.kristeligt-dagblad.dk/danmark/inge-krogh-er-doed-hun-kaempede-mod-boernepornografi-mens-andre-kaldte-et-forbud",
    "https://web.archive.org/web/20230216060454/https://www.science.org/content/article/religious-and-conservative-states-search-more-internet-pornography",
    "https://web.archive.org/web/20230217205540/https://jyllands-posten.dk/kultur/ECE12290907/i-11-aar-var-danmark-hele-verdens-boernepornomekka-hvorfor-greb-ingen-ind/",
    "https://web.archive.org/web/20200426040234/https://www.netflix.com/title/80038162",
    "https://web.archive.org/web/20230209124844/https://www.independent.co.uk/arts-entertainment/films/hong-kong-filmmakers-shoot-first-3d-porn-film-2048267.html",
    "https://web.archive.org/web/20140311164622/http://business.avn.com/articles/technology/Magnet-Media-Holds-Porn-Tech-Event-in-NYC-This-Tuesday-551837.html",
    "https://web.archive.org/web/20210113015947/https://www.bbc.com/news/technology-30307657",
    "https://web.archive.org/web/20140429045116/http://business.avn.com/articles/video/The-Truth-About-California-s-Adult-Entertainment-Industry-White-Paper-1999-35686.html",
    "https://web.archive.org/web/20140821073649/http://business.avn.com/company-news/Takedown-Piracy-Celebrates-Fifth-Anniversary-560384.html",
    "https://web.archive.org/web/20200918201217/https://www.vice.com/en_us/article/j5yzpk/they-cant-stop-us-people-are-having-sex-with-3d-avatars-of-their-exes-and-celebrities",
    "https://web.archive.org/web/20210110163221/https://www.nbcnews.com/business/business-news/things-are-looking-americas-porn-industry-n289431",
    "https://web.archive.org/web/20151231190855/http://query.nytimes.com/gst/abstract.html?res=9807E4D91739EF3BBC4852DFBE668382679EDE",
    "http://digitalcommons.law.umaryland.edu/fac_pubs/1420/",
    "https://archives.lib.state.ma.us/handle/2452/867308",
    "https://web.archive.org/web/20230619073912/https://archives.lib.state.ma.us/handle/2452/867308",
    "https://www.jstor.org/stable/41826241",
    "https://www.routledgehandbooks.com/doi/10.4324/9781315179582",
    "https://doi.org/10.1080%2F00224499.2017.1291798",
    "https://doi.org/10.2196%2F16702",
    "https://doi.org/10.1016%2Fj.chb.2009.04.003",
    "https://web.archive.org/web/20230425163348/http://news.bbc.co.uk/2/hi/uk_news/759268.stm",
    "http://news.bbc.co.uk/1/hi/uk/759268.stm",
    "https://doi.org/10.1017%2F9781108131797.046",
    "https://doi.org/10.1007%2Fs10508-019-01554-4",
    "https://web.archive.org/web/20230525052443/https://www.medicalnewstoday.com/articles/is-porn-bad",
    "https://www.medicalnewstoday.com/articles/is-porn-bad",
    "https://web.archive.org/web/20230528065432/https://corporate.findlaw.com/litigation-disputes/movie-day-at-the-supreme-court-or-i-know-it-when-i-see-it-a.html",
    "https://corporate.findlaw.com/litigation-disputes/movie-day-at-the-supreme-court-or-i-know-it-when-i-see-it-a.html",
    "https://www.marieclaire.com/sex-love/g15881538/best-softcore-porn-movies/",
    "https://web.archive.org/web/20230428135203/https://www.marieclaire.com/sex-love/g15881538/best-softcore-porn-movies/",
    "https://doi.org/10.1002%2F9781118896877.wbiehs366",
    "https://www.bbc.com/news/business-48283409",
    "https://web.archive.org/web/20230428000629/https://www.bbc.com/news/business-48283409",
    "https://www.cosmopolitan.com/sex-love/a20916460/safe-porn-to-watch/",
    "https://web.archive.org/web/20230602081001/https://www.cosmopolitan.com/sex-love/a20916460/safe-porn-to-watch/",
    "https://web.archive.org/web/20230611165332/https://www.thelocal.dk/20190531/denmark-legalized-pornography-50-years-ago-did-the-decision-turn-out-as-expected",
    "https://www.thelocal.dk/20190531/denmark-legalized-pornography-50-years-ago-did-the-decision-turn-out-as-expected/",
    "https://supreme.justia.com/cases/federal/us/394/557/",
    "https://supreme.justia.com/cases/federal/us/521/844/",
    "https://doi.org/10.5250%2Fquiparle.21.2.0101",
    "https://www.jstor.org/stable/10.5250/quiparle.21.2.0101",
    "https://api.semanticscholar.org/CorpusID:142877483",
    "http://business.avn.com/articles/video/The-Big-New-Wave-of-Porn-Parodies-348804.html",
    "https://web.archive.org/web/20230524235544/https://avn.com/business/articles/video/the-big-new-wave-of-porn-parodies-348804.html",
    "https://www.vice.com/en_us/article/kwp97y/mormon-themed-porn-is-apparently-a-booming-business",
    "https://www.naag.org/attorney-general-journal/an-update-on-the-legal-landscape-of-revenge-porn/",
    "https://doi.org/10.1002%2F9781118896877.wbiehs367",
    "https://web.archive.org/web/20230523191421/https://www.naag.org/attorney-general-journal/an-update-on-the-legal-landscape-of-revenge-porn/",
    "https://works.bepress.com/rebecca-whisnant/7/",
    "https://www.newyorker.com/magazine/2016/09/26/making-sense-of-modern-pornography",
    "https://web.archive.org/web/20230423194041/https://www.newyorker.com/magazine/2016/09/26/making-sense-of-modern-pornography",
    "https://www.cosmopolitan.com/sex-love/a8616324/porn-industry-adult-entertainment-changes/",
    "https://web.archive.org/web/20221218211524/https://www.cosmopolitan.com/sex-love/a8616324/porn-industry-adult-entertainment-changes/",
    "http://www.latimes.com/entertainment/envelope/cotown/la-fi-c1-xbiz-awards-20140205-dto-htmlstory.html",
    "https://web.archive.org/web/20230501141241/http://www.latimes.com/entertainment/envelope/cotown/la-fi-c1-xbiz-awards-20140205-dto-htmlstory.html",
    "https://www.gq.com/gallery/the-most-brilliant-porn-parodies-of-all-time",
    "https://web.archive.org/web/20230323045726/https://www.gq.com/gallery/the-most-brilliant-porn-parodies-of-all-time",
    "https://doi.org/10.1080%2F23268743.2013.863659",
    "https://www.theregister.com/2010/01/28/australian_censors/",
    "https://web.archive.org/web/20230405054316/https://www.theregister.com/2010/01/28/australian_censors/",
    "https://www.independent.co.uk/news/uk/home-news/uk-porn-legislation-what-is-now-banned-under-new-government-laws-9898541.html",
    "https://web.archive.org/web/20230531214014/https://www.independent.co.uk/news/uk/home-news/uk-porn-legislation-what-is-now-banned-under-new-government-laws-9898541.html",
    "https://doi.org/10.1038%2Fs41443-020-00380-w",
    "https://www.sup.org/books/title/?id=31053",
    "https://doi.org/10.1080%2F23268743.2018.1436260",
    "https://doi.org/10.4324%2F9781315179582",
    "https://api.semanticscholar.org/CorpusID:203303010",
    "https://books.google.com/books?id=m29oAgAAQBAJ",
    "https://api.semanticscholar.org/CorpusID:216452122",
    "https://books.google.com/books?id=JAw6zQEACAAJ",
    "https://books.google.com/books?id=TCZTDwAAQBAJ",
    "http://nrl.northumbria.ac.uk/id/eprint/44168/1/Postscript%20to%20Special%20Section%20Final%20CS.pdf",
    "http://irep.ntu.ac.uk/id/eprint/30387/1/PubSub8168_Griffiths.pdf",
    "https://pubmed.ncbi.nlm.nih.gov/28276929",
    "https://api.semanticscholar.org/CorpusID:24837743",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7256746",
    "https://pubmed.ncbi.nlm.nih.gov/32406863",
    "https://api.semanticscholar.org/CorpusID:148653876",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7058557",
    "https://pubmed.ncbi.nlm.nih.gov/31549362",
    "https://www.researchgate.net/publication/354820821",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7699018",
    "https://pubmed.ncbi.nlm.nih.gov/33249423",
    "https://archive.today/20120629182137/http://www.zetetics.com/mac/xxx/",
    "https://archive.today/20120802205140/http://www.ipbrief.net/2012/02/16/4803/",
    "https://link.springer.com/article/10.1007/s10508-018-1304-6",
    "https://doi.org/10.1007%2Fs10508-018-1304-6",
    "https://pubmed.ncbi.nlm.nih.gov/30187150",
    "https://api.semanticscholar.org/CorpusID:254266781",
    "https://legislink.org/us/stat-17-598",
    "https://www.tandfonline.com/doi/full/10.1080/0092623X.2017.1377131",
    "https://doi.org/10.1080%2F0092623X.2017.1377131",
    "https://doi.org/10.1007/s10508-016-0770-y",
    "https://doi.org/10.1007%2Fs10508-016-0770-y",
    "https://jech.bmj.com/content/70/1/3",
    "https://doi.org/10.1136%2Fjech-2015-205453",
    "https://pubmed.ncbi.nlm.nih.gov/26022057",
    "https://books.google.com/books?id=8WAsAAAAQBAJ",
    "https://api.semanticscholar.org/CorpusID:39308489",
    "https://api.semanticscholar.org/CorpusID:254262641",
    "https://api.semanticscholar.org/CorpusID:3682854",
    "https://pubmed.ncbi.nlm.nih.gov/27388511",
    "https://pubmed.ncbi.nlm.nih.gov/28885897",
    "https://doi.org/10.1080%2F00224499.2012.719168",
    "https://doi.org/10.1080%2F00224499.2018.1451476",
    "https://api.semanticscholar.org/CorpusID:21131799",
    "https://api.semanticscholar.org/CorpusID:4989437",
    "https://pubmed.ncbi.nlm.nih.gov/23167939",
    "https://pubmed.ncbi.nlm.nih.gov/29669431",
    "https://www.jstor.org/stable/4200209",
    "https://www.jstor.org/stable/42002094",
    "https://rutgers.nl/wp-content/uploads/2024/01/onderzoek-seks-onder-je-25e-2023.pdf",
    "https://archive.org/details/encyclopediaofwo00lond",
    "https://www.abebooks.com/9780892817191/Encyclopedia-Sacred-Sexuality-Aphrodisiacs-Exstasy-0892817194/plp",
    "https://archive.org/details/TheIllustratedEncyclopediaOfHinduism...",
    "https://books.google.com/books?id=BmdQAAAAMAAJ",
    "https://books.google.com/books?id=x2u6BAAAQBAJ",
    "https://books.google.com/books?id=tronAAAAYAAJ",
    "https://books.google.com/books?id=LexraSEgRfIC",
    "https://books.google.com/books?id=opjFswEACAAJ",
    "https://archive.org/details/in.ernet.dli.2015.187888",
    "https://archive.org/details/TheIllustratedEncyclopediaOfHinduism.../page/n700/mode/1up?view=theater",
    "https://doi.org/10.1177/1363460719861832",
    "https://doi.org/10.1177%2F1363460719861832",
    "https://www.jstor.org/stable/20106970",
    "https://doi.org/10.1111/rec3.12162",
    "https://doi.org/10.1111%2Frec3.12162",
    "https://doi.org/10.1111/j.1540-6385.2009.00431.x",
    "https://doi.org/10.1111%2Fj.1540-6385.2009.00431.x",
    "https://archive.org/details/the-complete-kama-sutra-the-first-unabridged-modern-translation-of-the-classic-i/page/42/mode/1up?view=theater",
    "https://archive.org/details/the-complete-kama-sutra-the-first-unabridged-modern-translation-of-the-classic-i/page/43/mode/1up?view=theater",
    "https://books.google.com/books?id=RvO0vO575owC",
    "https://web.archive.org/web/20110226184207/http://indology.info/papers/cousins/",
    "https://doi.org/10.1017%2Fs1356186300014760",
    "https://api.semanticscholar.org/CorpusID:162929573",
    "https://www.jstor.org/stable/25183119",
    "http://indology.info/papers/cousins",
    "https://doi.org/10.1177%2F009164711504300104",
    "https://web.archive.org/web/20231205232708/https://www.thedailybeast.com/porn-needs-to-rethink-its-sti-testing-before-its-too-late",
    "https://web.archive.org/web/20240310100157/https://www.news.com.au/lifestyle/relationships/sex/australian-porn-star-reveals-surprising-fact-about-the-industry/news-story/1dab1bea257d2bb22651cf5d83e227ca",
    "https://web.archive.org/web/20231129131600/https://www.smh.com.au/national/porn-star-angela-white-studied-at-melbourne-uni-to-know-the-enemy-20221125-p5c17p.html",
    "https://www.thedailybeast.com/porn-needs-to-rethink-its-sti-testing-before-its-too-late",
    "https://www.news.com.au/lifestyle/relationships/sex/australian-porn-star-reveals-surprising-fact-about-the-industry/news-story/1dab1bea257d2bb22651cf5d83e227ca",
    "https://www.smh.com.au/national/porn-star-angela-white-studied-at-melbourne-uni-to-know-the-enemy-20221125-p5c17p.html",
    "https://doi.org/10.1177%2F0959353520918164",
    "https://research.monash.edu/en/publications/pornography-and-sexual-relationships-discursive-challenges-for-yo",
    "https://doi.org/10.1007%2Fs40806-016-0057-5",
    "https://link.springer.com/article/10.1007/s40806-016-0057-5",
    "https://doi.org/10.1007/s10508-023-02534-5",
    "https://doi.org/10.1007%2Fs10508-023-02534-5",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10125950",
    "https://pubmed.ncbi.nlm.nih.gov/36853349",
    "https://books.google.com/books?id=YZFEzl4SuU4C",
    "https://doi.org/10.1007%2Fs11407-006-9022-4",
    "https://doi.org/10.1080%2F23268743.2013.859468",
    "https://doi.org/10.1177%2F0963721420979594",
    "https://doi.org/10.1080%2F02500160508538002",
    "https://search.worldcat.org/oclc/1331692",
    "https://search.worldcat.org/issn/1095-5054",
    "https://search.worldcat.org/issn/2326-8743",
    "https://search.worldcat.org/issn/0734-1512",
    "https://search.worldcat.org/issn/0743-5584",
    "https://search.worldcat.org/issn/1360-807X",
    "https://search.worldcat.org/issn/1356-1863",
    "https://search.worldcat.org/issn/1573-7780",
    "https://search.worldcat.org/issn/0895-3309",
    "https://search.worldcat.org/issn/0004-0002",
    "https://search.worldcat.org/issn/0022-4499",
    "https://search.worldcat.org/issn/0143-005X",
    "https://search.worldcat.org/issn/1573-2800",
    "https://search.worldcat.org/issn/1559-8519",
    "https://search.worldcat.org/issn/0092-623X",
    "https://search.worldcat.org/issn/0362-4331",
    "https://books.google.com/books?id=RvO0vO575owC&pg=PA56",
    "https://doi.org/10.1177%2F089124302236992",
    "https://academic.oup.com/jsm/article/18/3/539/6955982",
    "https://doi.org/10.1016%2Fj.jsxm.2020.12.011",
    "https://search.worldcat.org/issn/1743-6109",
    "https://pubmed.ncbi.nlm.nih.gov/33526399",
    "https://oro.open.ac.uk/40961/2/BarkerPS2013.pdf",
    "https://doi.org/10.1080%2F15546128.2021.2019648",
    "https://www.foxnews.com/story/porn-industry-may-decide-dvd-format-war",
    "https://doi.org/10.2307/601526",
    "https://books.google.com/books?id=-fhdAQAAQBAJ",
    "https://doi.org/10.2307%2F601526",
    "https://www.jstor.org/stable/601526",
    "https://researchonline.jcu.edu.au/71215/1/JCU_Miller%20&%20McBain%202021%20AJSE%20Accepted%20MS.pdf",
    "https://www.vaestoliitto.fi/artikkelit/porno-koetaan-entista-kiihottavammaksi/",
    "https://doi.org/10.3390%2Frel12050368",
    "https://www.nli.org.il/en/authorities/987007565601405171",
    "https://web.archive.org/web/20241125082244/https://www.usatoday.com/story/life/health-wellness/2024/11/02/how-to-stop-porn-addiction/75876700007/",
    "https://www.usatoday.com/story/life/health-wellness/2024/11/02/how-to-stop-porn-addiction/75876700007/",
    "https://doi.org/10.1002%2F9781118896877.wbiehs362",
    "https://libris.kb.se/64jlkjzq282jg9p",
    "https://doi.org/10.1177%2F14747049211028798",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10355306",
    "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9755930",
    "https://pubmed.ncbi.nlm.nih.gov/34180252",
    "https://www.irishexaminer.com/lifestyle/arid-20265332.html",
    "https://www.bbc.com/news/newsbeat-19916324",
    "https://www.vice.com/en/article/sex-workers-what-visa-and-mastercard-dropping-pornhub-means-to-performers/",
    "https://spectator.org/the-pornography-empire-continues-its-collapse-onlyfans-has-fallen/",
    "https://theconversation.com/ai-generated-pornography-will-disrupt-the-adult-content-industry-and-raise-new-ethical-concerns-226683",
    "https://web.archive.org/web/20250221054932/https://www.irishexaminer.com/lifestyle/arid-20265332.html",
    "https://web.archive.org/web/20250126211501/https://www.bbc.com/news/newsbeat-19916324",
    "https://web.archive.org/web/20250116072059/https://www.vice.com/en/article/sex-workers-what-visa-and-mastercard-dropping-pornhub-means-to-performers/",
    "https://web.archive.org/web/20250111094152/https://spectator.org/the-pornography-empire-continues-its-collapse-onlyfans-has-fallen/",
    "https://web.archive.org/web/20241010072649/https://theconversation.com/ai-generated-pornography-will-disrupt-the-adult-content-industry-and-raise-new-ethical-concerns-226683",
    "https://datos.bne.es/resource/XX526455",
    "https://www.thetimes.com/comment/register/article/professor-sir-bernard-williams-6th6hfnkgt7"
  ],
  "categories": [
    "All Wikipedia articles written in American English",
    "Articles containing Ancient Greek (to 1453)-language text",
    "Articles containing French-language text",
    "Articles containing Greek-language text",
    "Articles with short description",
    "CS1: long volume value",
    "CS1 Danish-language sources (da)",
    "CS1 Dutch-language sources (nl)",
    "CS1 Finnish-language sources (fi)",
    "CS1 French-language sources (fr)",
    "CS1 Greek-language sources (el)",
    "CS1 Italian-language sources (it)",
    "CS1 errors: ISBN date",
    "Commons category link from Wikidata",
    "Pages using multiple image with auto scaled images",
    "Pornography",
    "Sexuality",
    "Short description is different from Wikidata",
    "Use American English from February 2019",
    "Use dmy dates from August 2021",
    "Webarchive template wayback links",
    "Wikipedia indefinitely move-protected pages",
    "Wikipedia indefinitely semi-protected pages"
  ],
  "links": [
    "2007 constitution of Thailand",
    "35 mm equivalent focal length",
    "3D Sex and Zen: Extreme Ecstasy",
    "3D computer graphics",
    "55th Street Playhouse",
    "69 (sex position)",
    "AIDS epidemic",
    "ASMR",
    "AT&T",
    "AVN (magazine)",
    "AVN Adult Entertainment Expo",
    "AVN Awards",
    "Abdullah Gymnastiar",
    "Abortion-rights movement",
    "Abortion law",
    "Abrahamic religions",
    "Absolute (philosophy)",
    "Abstract photography",
    "Academic journal",
    "Accountability software",
    "Active-pixel sensor",
    "Addiction (journal)",
    "Adolescent sexuality",
    "Adult Film Association of America",
    "Adult Performer Advocacy Committee",
    "Adult animation",
    "Adult film industry regulations",
    "Adult movie theater",
    "Adultcon",
    "Adultery",
    "Adultery laws",
    "Aerial photography",
    "Aesthetic",
    "Affirmative action",
    "Afocal photography",
    "Age of Enlightenment",
    "Age of consent",
    "Aircraft spotting",
    "Al Goldstein",
    "Alain Danielou",
    "Albert Kirchner",
    "Albumen print",
    "Aleister Crowley",
    "Alfred Kinsey",
    "Allan Ronald",
    "Alt porn",
    "Amateur pornography",
    "Amazon (company)",
    "Ambigram",
    "Ambrotype",
    "American Booksellers Ass'n, Inc. v. Hudnut",
    "American College of Emergency Physicians",
    "American Journal of Public Health",
    "American Psychologist",
    "Anal intercourse",
    "Anal sex",
    "Analytical psychology",
    "Anarchism and issues related to love and sex",
    "Ancient Greece",
    "Andrea Dworkin",
    "Androgynous",
    "Andrology",
    "Andy Warhol",
    "Angela White",
    "Angle of view (photography)",
    "Anglosphere",
    "Anilingus",
    "Anime",
    "Anna Span",
    "Annie Sprinkle",
    "Anonymity",
    "Anthony Comstock",
    "Anthony Grafton",
    "Anti-depressant",
    "Anti-miscegenation laws",
    "Anti-miscegenation laws in the United States",
    "Anti-pornography movement in the United Kingdom",
    "Anti-pornography movement in the United States",
    "Antipornography Civil Rights Ordinance",
    "Antisexualism",
    "Anxiety",
    "Anxiety disorders",
    "Aperture",
    "Applied psychology",
    "Arab world",
    "Architectural photography",
    "Archives of Sexual Behavior",
    "Ardhanarishvara",
    "Aristocracy",
    "Aristophanes",
    "Aromanticism",
    "Ars Amatoria",
    "Art",
    "Artha",
    "Artifact (archaeology)",
    "Asexuality",
    "Assur",
    "Assyria",
    "Astrophotography",
    "Athenaeus",
    "Audio porn",
    "Audiovisual Media Services Regulations 2014",
    "Aurignacian",
    "Australian Classification Board",
    "Australian Feminist Studies",
    "Autochrome Lumière",
    "BDSM",
    "BMC Public Health",
    "Backscatter (photography)",
    "Banquet photography",
    "Barcelona International Erotic Film Festival",
    "Bareback (sexual act)",
    "Beauty dish",
    "Berl Kutchinsky",
    "Bernard Faure",
    "Bernard Williams",
    "Betamax",
    "Bette Talvacchia",
    "Bettie Page",
    "Betty Dodson",
    "Betty Friedan",
    "Biblical",
    "Biology",
    "Birth control",
    "Bisexual pornography",
    "Bisexuality",
    "Black-and-white",
    "Black feminism",
    "Black women",
    "Bleach bypass",
    "Blu-ray",
    "Blue Movie",
    "Bob Guccione",
    "Bodily integrity",
    "Body image",
    "Body modification",
    "Bokeh",
    "Bondage pornography",
    "Bonnie Bullough",
    "Book of Genesis",
    "Boredom",
    "Box camera",
    "Boys in the Sand",
    "Brahman",
    "Brazilian advisory rating system",
    "Breast augmentation",
    "Brenizer method",
    "British Board of Film Classification",
    "British Museum",
    "Broadband",
    "Brussels International Festival of Eroticism",
    "Budapest",
    "Buddhism",
    "Buddhism and sexuality",
    "Buddhist monasticism",
    "Burst mode (photography)",
    "Burt Reynolds",
    "Bustle (magazine)",
    "C-41 process",
    "CMYK color model",
    "COPINE scale",
    "Caldron (sex club)",
    "Calotype",
    "Camera",
    "Camera lens",
    "Camera obscura",
    "Camera phone",
    "Camille Paglia",
    "Canadian Journal of Human Sexuality",
    "Candid photography",
    "Candida Royalle",
    "Capital punishment for homosexuality",
    "Caricature",
    "Carl Jung",
    "Cartoon pornography",
    "Casual dating",
    "Casual sex",
    "Catacombs (sex club)",
    "Catharine Edwards (historian)",
    "Catharine MacKinnon",
    "Cave painting",
    "Cave paintings",
    "Celebrity sex tape",
    "Celibacy",
    "Celibacy syndrome",
    "Centerfold",
    "Central Board of Film Censors",
    "Central Board of Film Certification",
    "Chanel Preston",
    "Charge-coupled device",
    "Charles de Morny",
    "Child Online Protection Act",
    "Child Pornography Prevention Act of 1996",
    "Child Protection Restoration and Penalties Enhancement Act of 1990",
    "Child Protection and Obscenity Enforcement Act",
    "Child erotica",
    "Child grooming",
    "Child pornography",
    "Child pornography in the Philippines",
    "Child pornography laws in Australia",
    "Child pornography laws in Canada",
    "Child pornography laws in Japan",
    "Child pornography laws in Portugal",
    "Child pornography laws in the Netherlands",
    "Child pornography laws in the United Kingdom",
    "Child pornography laws in the United States",
    "Child prostitution",
    "Child sex tourism",
    "Child sexual abuse",
    "Child sexuality",
    "China",
    "Chlamydia",
    "Christian mythology",
    "Christianity and sexual orientation",
    "Chromatic aberration",
    "Chromogenic print",
    "Churchmen's Committee for Decent Publications",
    "Circle of confusion",
    "Circumcision and law",
    "Civil union",
    "Classics",
    "Clerical celibacy",
    "Clerical celibacy in the Catholic Church",
    "Cleveland Museum of Art",
    "Clinical psychology",
    "Clipping (photography)",
    "Clitoral erection",
    "Clitoris",
    "Clop (erotic fan art)",
    "Cloudscape photography",
    "ClubJenna",
    "Club Baths",
    "Cold turkey",
    "Collodion process",
    "Color balance",
    "Color management",
    "Color photography",
    "Color print film",
    "Color space",
    "Color temperature",
    "Combined oral contraceptive pill",
    "Committed relationship",
    "Committee on Obscenity and Film Censorship",
    "Common law",
    "Communications Decency Act",
    "Community standards",
    "Comparison of digital SLRs",
    "Comparison of digital and film photography",
    "Composition (visual arts)",
    "Computer-generated imagery",
    "Computer programming",
    "Computers in Human Behavior",
    "Computerworld",
    "Comstock Act",
    "Conceptual photography",
    "Condom",
    "Condoms",
    "Consciousness",
    "Conservation and restoration of film",
    "Conservation and restoration of photographic plates",
    "Conservation and restoration of photographs",
    "Conservation photography",
    "Contre-jour",
    "Convent pornography",
    "Conventional sex",
    "Coping",
    "Copyright",
    "Cosmopolitan (magazine)",
    "Counterculture of the 1960s",
    "Creampie (sexual act)",
    "Criminal transmission of HIV",
    "Criminalization of homosexuality",
    "Critical psychology",
    "Critics Adult Film Association",
    "Cross processing",
    "Cucoloris",
    "Cultural studies",
    "Cum shot",
    "Cunnilingus",
    "Current Directions in Psychological Science",
    "Custodian of Records",
    "Cyanotype",
    "Cybersex",
    "Cybersex trafficking",
    "DVD",
    "Daguerreotype",
    "Danielle Citron",
    "Danni Ashe",
    "Darkroom",
    "Data communication",
    "Data compression",
    "David Foxon",
    "David Hurles",
    "David J. Ley",
    "Decriminalization of homosexuality",
    "Decriminalization of sex work",
    "Deep Throat (film)",
    "Deepfake",
    "Deepfake pornography",
    "Deipnosophists",
    "Deir el-Medina",
    "Delta of Venus",
    "Demimonde",
    "Demisexuality",
    "Denmark",
    "Depression (mood)",
    "Depth of field",
    "Depth of focus",
    "Developed country",
    "Deviant sexual intercourse",
    "Dharma",
    "Diagonal method",
    "Die Sexualität im Kulturkampf",
    "Digiscoping",
    "Digital Playground",
    "Digital age",
    "Digital camera",
    "Digital camera back",
    "Digital image processing",
    "Digital photography",
    "Digital single-lens reflex camera",
    "DirecTV",
    "Distribution (business)",
    "Divorce law by country",
    "Djellaba",
    "Documentary photography",
    "Dogging (sexual slang)",
    "Doggy style",
    "Doi (identifier)",
    "Domestic violence",
    "Dost test",
    "Double penetration",
    "Doxing",
    "Dufaycolor",
    "Dye coupler",
    "E-6 process",
    "Early Dynastic Period (Mesopotamia)",
    "EchoStar",
    "Eclipse photography",
    "Edging (sexual practice)",
    "Effects of pornography",
    "Eirin",
    "Ejaculation",
    "Electric current",
    "Ellen Willis",
    "Employee monitoring software",
    "Encyclopædia Britannica, Inc.",
    "Engravings",
    "Enlarger",
    "Enlightenment in Buddhism",
    "Erectile dysfunction",
    "Erection",
    "Eroge",
    "Erogenous zone",
    "Erotic art",
    "Erotic art in Pompeii and Herculaneum",
    "Erotic comics",
    "Erotic hypnosis",
    "Erotic literature",
    "Erotic photography",
    "Erotic sexual denial",
    "Erotic talk",
    "Erotica",
    "Eroticism",
    "Ethnic pornography",
    "Eugène Pirou",
    "Evolutionary Psychology (journal)",
    "Ex-voto",
    "Existence",
    "Exotic Erotic Ball",
    "Exposing to the right",
    "Exposure (photography)",
    "Exposure compensation",
    "Exposure value",
    "Extramarital sex",
    "Exxxotica Expo",
    "F-number",
    "Facial (sexual act)",
    "Family planning",
    "Fanny Hill",
    "Fans of X-Rated Entertainment",
    "Fashion photography",
    "Feature film",
    "Feature films",
    "Fellatio",
    "Female ejaculation",
    "Female genital mutilation",
    "Female promiscuity",
    "Female sex tourism",
    "Female sodomy",
    "Femininity",
    "Feminism & Psychology",
    "Feminist movements and ideologies",
    "Feminist pornography",
    "Feminist sex wars",
    "Feminist views of pornography",
    "Feminist views on pornography",
    "Feminists Fighting Pornography",
    "Fetter (Buddhism)",
    "Fictosexuality",
    "Field camera",
    "Fight the New Drug",
    "Figurine",
    "Fill flash",
    "Film Censorship Board of Malaysia",
    "Film base",
    "Film format",
    "Film holder",
    "Film photography",
    "Film scanner",
    "Film speed",
    "Film stock",
    "Films and Publications Act, 1996",
    "Financial capital",
    "Fine-art photography",
    "Fingering (sexual act)",
    "Finland",
    "Fire photography",
    "Fireworks photography",
    "First Amendment to the United States Constitution",
    "Fisheye lens",
    "Fisting",
    "Flash (photography)",
    "Flash synchronization",
    "Flirting",
    "Focal length",
    "Foot fetishism",
    "Footjob",
    "Forced orgasm",
    "Forced prostitution",
    "Forcible touching",
    "Forensic photography",
    "Foreplay",
    "Format war",
    "Fornication",
    "Forrester Research",
    "Fourth wall",
    "Foveon X3 sensor",
    "Framing (visual arts)",
    "Fred Halsted",
    "Free Speech Coalition",
    "Free love",
    "Freedom of speech",
    "Freedom of the press",
    "French Revolution",
    "Freudo-Marxism",
    "Friction burn",
    "Friends with benefits relationships",
    "Frontline (American TV program)",
    "Frot",
    "Fuck for Forest",
    "GQ",
    "Gail Dines",
    "Gallup, Inc.",
    "Gamiani",
    "Gang bang",
    "Gang bang pornography",
    "Gavin Flood",
    "Gay bathhouse",
    "Gay liberation",
    "Gay pornography",
    "Gelatin silver process",
    "Gender",
    "Gender binary",
    "Gender equality",
    "Gender identity",
    "Gender pay gap",
    "General Motors",
    "General Social Survey",
    "Generative AI pornography",
    "Generative artificial intelligence",
    "Geoffrey Parrinder",
    "Gerard Damiano",
    "Germany",
    "Giovanni Boccaccio",
    "Glamour photography",
    "Glenn W. Most",
    "Gobo (lighting)",
    "Goddess",
    "Golden Age of Porn",
    "Golden globes",
    "Golden triangle (composition)",
    "Gonorrhea",
    "Gonzo pornography",
    "Government Information Office",
    "Gray asexuality",
    "Greek language",
    "Group sex",
    "Guide number",
    "Gum printing",
    "Gynaecology",
    "H. Montgomery Hyde",
    "HBO",
    "HD DVD",
    "HIV",
    "HIV/AIDS",
    "HUMP!",
    "Hand-colouring of photographs",
    "Handjob",
    "Hardcore pornography",
    "Harris shutter",
    "Harvard University Press",
    "Headroom (photographic framing)",
    "Health Communication (journal)",
    "Helen Gurley Brown",
    "Heliography",
    "Hentai",
    "Hepatitis B",
    "Hepatitis C",
    "Heptaméron",
    "Herbivore men",
    "Heteronormative",
    "Heterosexuality",
    "Hicklin test",
    "Hierophany",
    "Hieros gamos",
    "High-speed photography",
    "High definition optical disc format war",
    "Hilton Worldwide",
    "Hindu cosmology",
    "Hinduism",
    "Hinduism and sexuality",
    "Hippie",
    "History and Technology",
    "History of erotic depictions",
    "History of human sexuality",
    "History of personal computers",
    "History of photography",
    "Holography",
    "Holy See",
    "Holywell Street, London",
    "Home video",
    "Homophobia",
    "Homosexual",
    "Homosexuality",
    "Hong Kong motion picture rating system",
    "Hot shoe",
    "Hotel",
    "Hugh Hefner",
    "Human female sexuality",
    "Human male sexuality",
    "Human sexual activity",
    "Human sexual response cycle",
    "Human sexuality",
    "Human trafficking",
    "Hustler (magazine)",
    "Hyperfocal distance",
    "Hypergamy",
    "Hypersexual",
    "Hypersexuality",
    "Hypoactive sexual desire disorder",
    "IPhone",
    "ISBN (identifier)",
    "ISSN (identifier)",
    "IT",
    "I Modi",
    "Identity (social science)",
    "Image sensor",
    "Image sharing",
    "Imagery of nude celebrities",
    "Inanna",
    "Incest",
    "Incest pornography",
    "Indecent exposure",
    "Indonesia",
    "Information Technology Act, 2000",
    "Infrared photography",
    "Ingénue",
    "Insemination",
    "Inside Deep Throat",
    "Instant camera",
    "Instant film",
    "Intentional camera movement",
    "International Journal of Hindu Studies",
    "International Journal of Impotence Research",
    "Internet",
    "Internet filter",
    "Internet pornography",
    "Intersectionality",
    "Intersex",
    "Intersex human rights",
    "Intimate partner violence",
    "Intimate relationship",
    "Irish Film Classification Office",
    "Irrumatio",
    "Islam by country",
    "Islamic sexual jurisprudence",
    "Italian Renaissance",
    "JSTOR (identifier)",
    "Jacobellis v. Ohio",
    "Jain monasticism",
    "Jamaica Kincaid",
    "Japan",
    "Japanese pornographic",
    "Jenna Jameson",
    "Jennifer Christine Nash",
    "Jesse Jane",
    "John Cleland",
    "John Sutherland (author)",
    "Jouissance",
    "Journal of Adolescent Research",
    "Journal of Economic Perspectives",
    "Journal of Happiness Studies",
    "Journal of Medical Internet Research",
    "Journal of Psychology and Theology",
    "Journal of Religion and Health",
    "Journal of Sex & Marital Therapy",
    "Journal of Sex Research",
    "Journal of the American Oriental Society",
    "Judaism and sexuality",
    "Julia Kristeva",
    "Justine (de Sade novel)",
    "K-14 process",
    "Kali",
    "Kama",
    "Kama Sutra",
    "Karen DeCrow",
    "Kate Millett",
    "Kayden Kross",
    "Khajuraho Group of Monuments",
    "Kinsey (film)",
    "Kinsey Reports",
    "Kirlian photography",
    "Kite aerial photography",
    "Konark Sun Temple",
    "Korea Media Rating Board",
    "Kundalini yoga",
    "LGBT",
    "LGBTQ-affirming religious groups",
    "LGBTQ and Leather Cultural District",
    "LGBTQ rights",
    "LGBTQ rights by country or territory",
    "LGBT culture",
    "LGBT culture in Dallas-Fort Worth",
    "LGBT culture in Houston",
    "LGBT culture in Miami",
    "LGBT culture in New York City",
    "LGBT culture in San Francisco",
    "Labia",
    "Labiaplasty",
    "Labor union",
    "Landscape photography",
    "Laptop",
    "Large format",
    "Larry Flynt",
    "Laurie Shrage",
    "Laws regarding child pornography",
    "Laws regarding rape",
    "Le Coucher de la Mariée",
    "Lead room",
    "Legal objections to pornography in the United States",
    "Legal protection of access to abortion",
    "Legal status of fictional pornography depicting minors",
    "Legal status of transgender people",
    "Legality of child pornography",
    "Legality of conversion therapy",
    "Legality of incest",
    "Lens flare",
    "Lens hood",
    "Lesbian erotica",
    "Lesbian feminism",
    "Lesbian pornography",
    "Libertine",
    "Liberty Media",
    "Libido",
    "Life",
    "Light field camera",
    "Linda Lovelace",
    "Linda Williams (film scholar)",
    "Lippmann plate",
    "List of British pornographic actors",
    "List of NC-17 rated films",
    "List of Norwegian photographers",
    "List of Polish photographers",
    "List of United States Supreme Court cases, volume 394",
    "List of United States Supreme Court cases, volume 521",
    "List of actors in gay pornographic films",
    "List of discontinued photographic films",
    "List of hentai creators",
    "List of largest photographs",
    "List of mainstream actors who have appeared in pornographic films",
    "List of most expensive photographs",
    "List of most visited websites",
    "List of museums devoted to one photographer",
    "List of online video platforms",
    "List of photographers",
    "List of photographic equipment makers",
    "List of photographic films",
    "List of photographic processes",
    "List of photographs considered the most important",
    "List of photography periodicals",
    "List of pornographic actors who appeared in mainstream films",
    "List of pornographic film directors",
    "List of pornographic film studios",
    "List of pornographic magazines",
    "List of pornography companies",
    "List of religions and spiritual traditions",
    "List of sex museums",
    "List of street photographers",
    "List of women photographers",
    "Literature reviews",
    "Little Birds (short story collection)",
    "Lo-fi photography",
    "Long-exposure photography",
    "Long-focus lens",
    "Longitudinal study",
    "Los Angeles County",
    "Los Angeles County, California",
    "Love shyness",
    "Lovelace (film)",
    "Loving v. Virginia",
    "Luminogram",
    "Lust",
    "Lysistrata",
    "MILF pornography",
    "MPEG-4",
    "Macro photography",
    "Magnus Hirschfeld",
    "Make Love, Not War: The Sexual Revolution: An Unfettered History",
    "Make love, not war",
    "Male contraceptive",
    "Mammary intercourse",
    "Manga",
    "Marcantonio Raimondi",
    "Margaret Sanger",
    "Marguerite de Navarre",
    "Marie Claire",
    "Marilyn Chambers",
    "Marital rape",
    "Marquis de Sade",
    "Marriage",
    "Marriageable age",
    "Marriott International",
    "Martin Amis",
    "Marty Klein",
    "Mary Anne Franks",
    "Masculinity",
    "Masochism",
    "Massachusetts",
    "Mastercard",
    "Masters and Johnson",
    "Masters and Johnson Institute",
    "Masturbation",
    "Matha",
    "McGill University",
    "Measure B",
    "Mechanics of human sexuality",
    "Medieval India",
    "Medium format",
    "Meese Report",
    "Meg-John Barker",
    "Melanie Klein",
    "Men who have sex with men",
    "Mesopotamia",
    "Metering mode",
    "Michael Kimmel",
    "Michel Foucault",
    "Micropayment",
    "Middle East",
    "Miller Test",
    "Miller v. California",
    "Milton Diamond",
    "MindGeek",
    "Mineshaft (gay club)",
    "Miniature faking",
    "Ministry of Communications and Information",
    "Mireille Miller-Young",
    "Mirrorless camera",
    "Miscegenation",
    "Missionary position",
    "Mobile porn",
    "Moche culture",
    "Modesty",
    "Moksha",
    "Monasticism",
    "Monochrome photography",
    "Monolight",
    "Monopod",
    "Mordançage",
    "Mormon pornography",
    "Motion Picture Association",
    "Motion picture content rating system",
    "Movie and Television Review and Classification Board",
    "Movie projector",
    "Muhammad",
    "Multi-exposure HDR capture",
    "Multiple exposure",
    "Murder of Jane Longhurst",
    "My Secret Life (memoir)",
    "Myra Breckinridge",
    "NYU Journal of Intellectual Property & Entertainment Law",
    "Naples",
    "Napoleon III",
    "Nathaniel Butter",
    "National Geographic (magazine)",
    "National Radio and Television Administration",
    "Nature photography",
    "Netherlands",
    "Netherlands Institute for the Classification of Audiovisual Media",
    "Netscape navigator",
    "Neues Sehen",
    "Neuroscience",
    "Neuroscience & Biobehavioral Reviews",
    "New Andy Warhol Garrick Theatre",
    "New York v. Ferber",
    "Night photography",
    "Nikolaos Stampolidis",
    "Nina Hartley",
    "Nipple stimulation",
    "Nirvana",
    "NoFap",
    "No More Page 3",
    "Nocturnal emission",
    "Non-penetrative sex",
    "Nondualism",
    "Nordic countries",
    "Norway",
    "Norwegian Media Authority",
    "Not safe for work",
    "Nude photography",
    "Nudist",
    "Nudity",
    "Nudity in film",
    "Numinous",
    "Nursing",
    "OCLC (identifier)",
    "Obergefell v. Hodges",
    "Obesity and sexuality",
    "Obscene Publications Act 1857",
    "Obscene Publications Act 1959",
    "Obscenity",
    "Ode to Aphrodite",
    "Office of Film and Literature Classification",
    "Oliver James (psychologist)",
    "One-night stand",
    "Online shopping",
    "OnlyFans",
    "Opposition to pornography",
    "Optional Protocol on the Sale of Children, Child Prostitution and Child Pornography",
    "Oral sex",
    "Orgasm",
    "Orgasm gap",
    "Orgy",
    "Osborne v. Ohio",
    "Oscar Wilde",
    "Oscars",
    "Osmo Kontula",
    "Other (philosophy)",
    "Outline of human sexuality",
    "Outline of photography",
    "Overwatch and pornography",
    "Ovid",
    "Oxford English Dictionary",
    "Oxford University Press",
    "PLISSIT model",
    "PMC (identifier)",
    "PMID (identifier)",
    "PROTECT Act of 2003",
    "Pacific Standard",
    "Pacific War",
    "Paganism",
    "Page 3",
    "Painted photography backdrops",
    "Pandaka",
    "Panning (camera)",
    "Panoramic photography",
    "Pansexuality",
    "Paraphilia",
    "Parental controls",
    "Parody",
    "Pat Califia",
    "Paul Cartledge",
    "Pay-per-view",
    "Paysite",
    "Peace movement",
    "Pedophile advocacy groups",
    "Peep shows",
    "Peer-review",
    "Peer-reviewed",
    "Peer-to-peer file sharing",
    "Pelvic thrust",
    "Penthouse (magazine)",
    "People v. Freeman",
    "Personal lubricant",
    "Perspective distortion",
    "Pheromone",
    "Photogram",
    "Photograph",
    "Photographic developer",
    "Photographic film",
    "Photographic filter",
    "Photographic fixer",
    "Photographic plate",
    "Photographic print toning",
    "Photographic printing",
    "Photographic processing",
    "Photography",
    "Photography and the law",
    "Photography in Albania",
    "Photography in Bangladesh",
    "Photography in Canada",
    "Photography in China",
    "Photography in Denmark",
    "Photography in Greece",
    "Photography in India",
    "Photography in Japan",
    "Photography in Korea",
    "Photography in Luxembourg",
    "Photography in Norway",
    "Photography in Serbia",
    "Photography in Slovenia",
    "Photography in Sudan",
    "Photography in Taiwan",
    "Photography in Turkey",
    "Photography in Ukraine",
    "Photography in Uzbekistan",
    "Photography in Vietnam",
    "Photography in the Philippines",
    "Photography in the United States",
    "Photojournalism",
    "Physical attractiveness",
    "Physiology",
    "Pictorialism",
    "Pigeon photography",
    "Pinhole camera",
    "Pink Visual",
    "Pink film",
    "Pixel",
    "Plato's Retreat",
    "Playboy",
    "Playboy Indonesia",
    "Playgirl",
    "Pokémon and pornography",
    "Polaroid art",
    "Polyamory",
    "Pompeii",
    "Pompoir",
    "Porn",
    "Porn (disambiguation)",
    "Porn 2.0",
    "Porn Studies",
    "Porn Sunday",
    "Porn for women",
    "Porn parody",
    "Pornhub",
    "Pornification",
    "Pornocracy",
    "Pornographic film",
    "Pornographic film actor",
    "Pornographic magazine",
    "Pornographic parody film",
    "Pornography (disambiguation)",
    "Pornography Law (Indonesia)",
    "Pornography Victims Compensation Act",
    "Pornography addiction",
    "Pornography by region",
    "Pornography in Canada",
    "Pornography in Denmark",
    "Pornography in Japan",
    "Pornography in Turkey",
    "Pornography in the United Kingdom",
    "Pornography in the United States",
    "Pornography laws by region",
    "Pornotopia",
    "Portrait photography",
    "Post-mortem photography",
    "Pre-ejaculate",
    "Pre-exposure prophylaxis",
    "Pregnancy",
    "Prehistoric",
    "Premarital sex",
    "President's Commission on Obscenity and Pornography",
    "Press camera",
    "Primary color",
    "Prime lens",
    "Print permanence",
    "Printing press",
    "Procuring (prostitution)",
    "Prohibitory Order",
    "Promiscuity",
    "Prose",
    "Prostitution",
    "Prostitution law",
    "Protests of 1968",
    "Proto-Indo-European language",
    "Psyche (psychology)",
    "Psychoanalysis",
    "Psychological stress",
    "Psychologist",
    "Psychology",
    "Psychosexual disorder",
    "Pubic Wars",
    "Public health",
    "Public morality",
    "Public sex",
    "Purity in Buddhism",
    "Purushartha",
    "Push processing",
    "Queer",
    "Queer heterosexuality",
    "Queer pornography",
    "Quickie (sex)",
    "Quran",
    "R18 (British Board of Film Classification)",
    "RGB color model",
    "R v Butler",
    "R v Glad Day Bookshops Inc",
    "R v Peacock",
    "Radiocarbon dating",
    "Radley Metzger",
    "Ralph Ginzburg",
    "Rangefinder camera",
    "Rape",
    "Rape pornography",
    "Ratirahasya",
    "Reality pornography",
    "Reciprocity (photography)",
    "Red-eye effect",
    "Red-figure pottery",
    "Red-light district",
    "RedTube",
    "Redscale",
    "Reflector (photography)",
    "Religion and LGBTQ people",
    "Religion and sexuality",
    "Religions",
    "Religious views on pornography",
    "Renee Gracie",
    "Reno v. ACLU",
    "Reno v. American Civil Liberties Union",
    "Renton v. Playtime Theatres, Inc.",
    "Rephotography",
    "Reproductive medicine",
    "Reproductive rights",
    "Republika (Indonesian newspaper)",
    "Retail",
    "Revenge porn",
    "Revenge pornography",
    "Reversal film",
    "Ribaldry",
    "Right to privacy",
    "Right to sexuality",
    "Riley Steele",
    "Robert Mapplethorpe",
    "Robert T. Francoeur",
    "Robert Weiss (therapist)",
    "Rock art",
    "Rollout photography",
    "Roman art",
    "Romance (love)",
    "Romantic orientation",
    "Rome",
    "Ronald Weitzer",
    "Rotary printing press",
    "Ruins photography",
    "Rule 34",
    "Rule of thirds",
    "Ruth Westheimer",
    "S2CID (identifier)",
    "SAGE Publishing",
    "SSRN (identifier)",
    "Sabattier effect",
    "Sacred prostitution",
    "Sacred prostitution in ancient Greece",
    "Sadomasochism",
    "Safe sex",
    "Safelight",
    "Salman Rushdie",
    "Same-sex adoption",
    "Same-sex marriage",
    "San Fernando Valley",
    "Sandstone retreat",
    "Sanskrit",
    "Sappho",
    "Sarah B. Pomeroy",
    "Satan",
    "Satellite television",
    "Scanography",
    "Schlieren photography",
    "Science of photography",
    "Scotland",
    "Search engine",
    "Secret Museum",
    "Section 63 of the Criminal Justice and Immigration Act 2008",
    "Seduction (tort)",
    "Seizures",
    "Selfie",
    "Set (film and TV scenery)",
    "Sex-positive feminism",
    "Sex-positive feminists",
    "Sex-positive movement",
    "Sex Addicts Anonymous",
    "Sex and drugs",
    "Sex and nudity in video games",
    "Sex and the law",
    "Sex doll",
    "Sex education",
    "Sex education in the United States",
    "Sex in advertising",
    "Sex in film",
    "Sex in space",
    "Sex industry",
    "Sex life",
    "Sex magic",
    "Sex offender",
    "Sex offender registries in the United States",
    "Sex offender registry",
    "Sex position",
    "Sex positions",
    "Sex positive",
    "Sex robots",
    "Sex shop",
    "Sex shops",
    "Sex therapy",
    "Sex tourism",
    "Sex toy",
    "Sex toys",
    "Sex trafficking",
    "Sex worker",
    "Sex worker movements",
    "Sex workers' rights",
    "Sexecology",
    "Sexercise",
    "Sexism",
    "Sexology",
    "Sexting",
    "Sexual Addiction & Compulsivity",
    "Sexual abstinence",
    "Sexual abuse",
    "Sexual addiction",
    "Sexual and reproductive health",
    "Sexual and reproductive health and rights",
    "Sexual arousal",
    "Sexual assault",
    "Sexual attraction",
    "Sexual capital",
    "Sexual consent",
    "Sexual consent in law",
    "Sexual content",
    "Sexual content in video games",
    "Sexual diversity",
    "Sexual dysfunction",
    "Sexual ethics",
    "Sexual fantasy",
    "Sexual fetishism",
    "Sexual frustration",
    "Sexual function",
    "Sexual guilt",
    "Sexual harassment",
    "Sexual identity",
    "Sexual intercourse",
    "Sexual jealousy",
    "Sexual medicine",
    "Sexual misconduct",
    "Sexual norm",
    "Sexual objectification",
    "Sexual obsessions",
    "Sexual orientation",
    "Sexual partner",
    "Sexual penetration",
    "Sexual polarity",
    "Sexual position",
    "Sexual relationship",
    "Sexual repression",
    "Sexual revolution",
    "Sexual slang",
    "Sexual slavery",
    "Sexual stimulation",
    "Sexual suggestiveness",
    "Sexual surrogate",
    "Sexual violence",
    "Sexualities (journal)",
    "Sexuality",
    "Sexuality & Culture",
    "Sexuality and Mormonism",
    "Sexuality and disability",
    "Sexuality in China",
    "Sexuality in Christian demonology",
    "Sexuality in India",
    "Sexuality in Japan",
    "Sexuality in South Korea",
    "Sexuality in ancient Rome",
    "Sexuality in the Philippines",
    "Sexuality in the United States",
    "Sexualization",
    "Sexually transmitted infection",
    "Sexually transmitted infections in the pornography industry",
    "Shakti",
    "Shame",
    "Shemale",
    "Shira Tarrant",
    "Shiva",
    "Showtime (TV network)",
    "Shunga",
    "Shutter speed",
    "Sigmund Freud",
    "Simplicity (photography)",
    "Simulated child pornography",
    "Sin",
    "Single-lens reflex camera",
    "Single person",
    "Sissy hypno",
    "Skin condition",
    "Slide projector",
    "Slit-scan photography",
    "Slow motion",
    "Slut-shaming",
    "Snoot",
    "Social capital",
    "Social documentary photography",
    "Social media",
    "Social norm",
    "Society",
    "Society for the Suppression of Vice",
    "Sociosexuality",
    "Sodomy law",
    "Sodomy laws in the United States",
    "Softbox",
    "Softcore pornography",
    "Sony Corporation",
    "Southeast Asia",
    "Space selfie",
    "Split attraction model",
    "Sports photography",
    "Stag film",
    "Stanley M. Burstein",
    "Stanley v. Georgia",
    "Statutory rape",
    "Stereoscopy",
    "Still life photography",
    "Stipulative definition",
    "Stock photography",
    "Stonewall riots",
    "Stop Bild Sexism",
    "Stop Child Trafficking Now",
    "Stop Porn Culture",
    "Stop bath",
    "Stopping down",
    "Story of O",
    "Story of the Eye",
    "Stoya",
    "Straight photography",
    "Streaming",
    "Streaming media",
    "Street photography",
    "Strip club",
    "Strip photography",
    "Striptease",
    "Subject and object (philosophy)",
    "Subscription business model",
    "Sumata",
    "Sumer",
    "Summer of Love",
    "Sun Microsystems",
    "Sun printing",
    "Supreme Court of California",
    "Supreme Court of the United States",
    "Survival sex",
    "Susie Bright",
    "Suzuki Harunobu",
    "Swinging (sexual practice)",
    "Swivel lens",
    "Syphilis",
    "Taishō era",
    "Tantra",
    "Tantric sex",
    "Taoist sexual practices",
    "Tasha Reign",
    "Teleny, or The Reverse of the Medal",
    "Telephoto lens",
    "Tentacle erotica",
    "Terabytes",
    "Terri Hall",
    "The Buddha",
    "The Decameron",
    "The Factory",
    "The Huffington Post",
    "The Journal of Men's Studies",
    "The Journal of Sex Research",
    "The Kiss (1896 film)",
    "The Local",
    "The Marriage Vow",
    "The New York Times",
    "The New Yorker",
    "The Notorious Bettie Page",
    "The Pearl (magazine)",
    "The Perfumed Garden",
    "The Romance of Lust",
    "The Sins of the Cities of the Plain",
    "The Times",
    "The personal is political",
    "Thelema",
    "Thomas Edison",
    "Three-CCD camera",
    "Threesome",
    "Tijuana bible",
    "Tilt–shift photography",
    "Tim Dean",
    "Time-lapse photography",
    "Time (magazine)",
    "Time Warner Cable",
    "Timeline of photography technology",
    "Tintype",
    "Tom Hodgkinson",
    "Toward a Feminist Theory of the State",
    "Toy camera",
    "Trade association",
    "Trait theory",
    "Transcendence (religion)",
    "Transgender pornography",
    "Treatise",
    "Tribadism",
    "Trichomoniasis",
    "Tripod (photography)",
    "Tripod head",
    "Tropic of Cancer (novel)",
    "Tropic of Capricorn (novel)",
    "Turban",
    "Turin Erotic Papyrus",
    "Twin-lens reflex camera",
    "USA Today",
    "Ultraviolet photography",
    "Underwater photography",
    "United Kingdom of Great Britain and Ireland",
    "United States Government Printing Office",
    "United States Reports",
    "United States Statutes at Large",
    "United States obscenity law",
    "United States v. Extreme Associates, Inc.",
    "United States v. Playboy Entertainment Group, Inc.",
    "United States v. Williams (2008)",
    "United States v. X-Citement Video, Inc.",
    "Unity of opposites",
    "Unsimulated sex",
    "Urethral intercourse",
    "Urolagnia",
    "Urology",
    "Usenet newsgroup",
    "VCR",
    "VHS",
    "Vaginal lubrication",
    "Value (ethics and social sciences)",
    "Vancouver School of Economics",
    "Vatsyayana",
    "Vending machine",
    "Venus Berlin",
    "Venus figurine",
    "Venus in Furs",
    "Venus in the Cloister",
    "Venus of Hohle Fels",
    "Vern Bullough",
    "Vernacular photography",
    "Victor Bockris",
    "Victorian era",
    "Video Recordings Act 2010",
    "Video cameras",
    "Video games",
    "Videography",
    "Videotape",
    "Videotape format war",
    "View camera",
    "Vignette (literature)",
    "Vignetting",
    "Vinaya",
    "Vincent Canby",
    "Violence against women",
    "Virginia E. Johnson",
    "Virtual reality headset",
    "Virtual reality pornography",
    "Virtual reality pornography (VR porn)",
    "Virtual sex",
    "Visa Inc.",
    "Visual Anthropology Review",
    "Visual anthropology",
    "Visual arts",
    "Voyeurism",
    "Vātsyāyana",
    "Waist–hip ratio",
    "Wake Forest Law Review",
    "Wayback Machine",
    "Web development",
    "Webcam model",
    "Webster's Dictionary",
    "Wedding photography",
    "Wendy Doniger",
    "Wendy Kaminer",
    "Wendy McElroy",
    "West Germany",
    "Western culture",
    "Western world",
    "Westin Hotels & Resorts",
    "Wet T-shirt contest",
    "Whatever (novel)",
    "Wi-Fi",
    "Wicked Pictures",
    "Wide-angle lens",
    "Wildlife photography",
    "Wilhelm Reich",
    "William Eskridge",
    "William Margold",
    "William Masters",
    "Women's erotica",
    "Women Against Pornography",
    "Women Against Violence in Pornography and Media",
    "Women who have sex with women",
    "World Charter for Prostitutes' Rights",
    "World Wide Web",
    "X-Rated Critics Organization",
    "XBIZ",
    "XBIZ Awards",
    "XVideos",
    "XXXchurch.com",
    "X rating",
    "Xerox art",
    "Yiff",
    "YouPorn",
    "Zachary Karabell",
    "Zebra patterning",
    "Zombie pornography",
    "Zone System",
    "Zone plate",
    "Zoom burst",
    "Zoom lens",
    "Zoophilia",
    "Zoophilic pornography",
    "Édouard-Henri Avril",
    "Ātman (Hinduism)"
  ],
  "images": [
    "https://upload.wikimedia.org/wikipedia/commons/6/65/11th_century_Bhoramdeo_temple_kama_scene_2.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/e/e2/1_Erotic_Kama_statues_of_Khajuraho_Hindu_Temple_Kandariya_Mahadeva_Khajur%C3%A2ho_India_2013.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/f/f2/2014-01-26_Roman_Oil_Lamp_with_Erotic_Motiv_00_anagoria.JPG",
    "https://upload.wikimedia.org/wikipedia/commons/7/71/2_Erotic_Kama_statues_of_Khajuraho_Hindu_Temple_de_Lakshmana_Khajur%C3%A2ho_India_2013.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/4/48/Aarre-Panula-1969.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/7/7d/Adult_area_entrance_in_video_rental_shop.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/5/5f/Ambigram_holy_man_porn_way.png",
    "https://upload.wikimedia.org/wikipedia/commons/d/dd/AmsterdamLasseBraun1977.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/d/df/Anime_girl_at_beach.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/1/17/Balance%2C_by_David.svg",
    "https://upload.wikimedia.org/wikipedia/commons/3/3a/Ballerina-icon.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/2/26/Bisexuality_symbol_%28bold%2C_color%29.svg",
    "https://upload.wikimedia.org/wikipedia/commons/8/8c/Blank_television_set.svg",
    "https://upload.wikimedia.org/wikipedia/commons/f/f9/Blue_Rose_sex_shop%2C_Camden.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/c/c2/Books-aj.svg_aj_ashton_01.png",
    "https://upload.wikimedia.org/wikipedia/commons/f/f9/Crystal_Clear_app_linneighborhood.svg",
    "https://upload.wikimedia.org/wikipedia/commons/0/0e/Delta_Sexshop%2C_Groningen_%282018%29_07.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/f/fc/Digital_Playground_Girls_2012.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/f/f2/Doryphoros._Naples%2C_National_Archaeological_Museum._%2849059407566%29.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/d/db/Erotic_scenes_Louvre_G13_n4.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/9/91/Erotic_sculptures%2C_Konark_16.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/8/83/Erotic_sculptures%2C_Konark_33.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/6/66/Erotikk-sjokk.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/8/8c/Fanny_Hill_1906_image03.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/4/41/Global_thinking.svg",
    "https://upload.wikimedia.org/wikipedia/commons/1/12/Hygiene_products_porn_set.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/1/13/If_people_start_thinking_freely_about_sex..._They_start_thinking_freely_about_everything%21%2C_Amsterdam_%282021%29_02.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/0/0f/India%2C_Himachal_Pradesh%2C_Mandi%2C_19th_century_-_Kali_on_Shiva_-_2014.650_-_Cleveland_Museum_of_Art.tif",
    "https://upload.wikimedia.org/wikipedia/commons/a/aa/Justine_ou_les_Malheurs_de_la_vertu_%28orgy_with_a_monk_2%29.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/4/44/Khajuraho-Lakshmana_Temple_erotic_detal1.JPG",
    "https://upload.wikimedia.org/wikipedia/commons/3/3c/La_grande_Epidemie_de_PORNOGRAPHIE.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/1/16/Lakshmi_Narasimha_Swamy_temple%2C_Bejjanki_Telangana_-_59.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/0/0d/LampArtifactDoggystyle.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/e/ea/Mithuna_Kama_Erotic_carving_on_a_pillar_in_the_Thousand-Pillared_Hall%2C_Meenakshi_Temple%2C_Madurai.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/8/82/Mithuna_kama_woman_woman_sex_scene%2C_temple_roof_ruin%2C_Panagal_Group_of_Temples%2C_Telangana_India_-_6.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/1/10/Naples_Museum_43_%2814972956878%29.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/a/a5/Nuvola_apps_bookcase.svg",
    "https://upload.wikimedia.org/wikipedia/commons/f/fc/Nuvola_apps_kpdf2.png",
    "https://upload.wikimedia.org/wikipedia/commons/c/cc/Pittore_schuwalow%2C_brocca_da_vino_con_scena_erotica%2C_attica_430_ac_ca.%2C_da_locri_01.JPG",
    "https://upload.wikimedia.org/wikipedia/commons/4/42/Porn_DVD_and_books_vending_machines_in_a_Japanese_backwoods_area.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/1/19/Pornproject_logo.svg",
    "https://upload.wikimedia.org/wikipedia/commons/b/bc/Red-figure_kylix_erotic_scene_%28Boston_MFA_1970.233%29.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/9/92/Roman_oil_Lamp_with_erotic_motif_01.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/4/46/Roman_oil_Lamp_with_erotic_motif_05.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/9/90/Satiro_che_abbraccia_una_ninfa%2C_da_casa_degli_epigrammi_a_pompei%2C_1-50_dc_ca%2C_27705.JPG",
    "https://upload.wikimedia.org/wikipedia/commons/0/0e/Scale_of_justice_2.svg",
    "https://upload.wikimedia.org/wikipedia/commons/2/26/Sex_shops%2C_49_Boulevard_de_Clichy%2C_Paris_24_August_2019.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/4/48/Sexkino_Odense.JPG",
    "https://upload.wikimedia.org/wikipedia/commons/7/7d/Shinjuku_sex_shop_dsc04912.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/3/3a/Trump_dildo_in_Amsterdam_sex_shop_02.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/0/07/Umbrella-159361.svg",
    "https://upload.wikimedia.org/wikipedia/commons/b/bc/Venere_di_Sinuessa%2C_da_Mondragone%2C_s.n.%2C_01.JPG",
    "https://upload.wikimedia.org/wikipedia/commons/a/a2/Venus_Berlin_2018_237.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/1/12/Venus_vom_Hohle_Fels-01.JPG",
    "https://upload.wikimedia.org/wikipedia/commons/f/fa/Wikiquote-logo.svg",
    "https://upload.wikimedia.org/wikipedia/commons/9/99/Wiktionary-logo-en-v2.svg",
    "https://upload.wikimedia.org/wikipedia/commons/9/94/XXX_P_icon.svg",
    "https://upload.wikimedia.org/wikipedia/commons/0/07/Young_woman_dreaming_of_an_erotic_encounter_%28c.1770%29_in_the_style_of_Harunobu_Suzuki_%28Housed_in_the_British_Museum%29_Print%2C_shunga_%28BM_OA%2B%2C0.83%29_%28cropped%29.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/a/a3/%E5%A4%A7%E5%89%B5%E6%A5%AD%E7%A5%AD_Akihabara%2C_Tokio_2002_%28516938442%29.jpg",
    "https://upload.wikimedia.org/wikipedia/en/4/4a/Commons-logo.svg",
    "https://upload.wikimedia.org/wikipedia/en/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg",
    "https://upload.wikimedia.org/wikipedia/en/1/1b/Semi-protection-shackle.svg",
    "https://upload.wikimedia.org/wikipedia/en/9/96/Symbol_category_class.svg",
    "https://upload.wikimedia.org/wikipedia/en/e/e2/Symbol_portal_class.svg",
    "https://upload.wikimedia.org/wikipedia/en/e/e7/Video-x-generic.svg"
  ],
  "timestamp": "2025-04-16T10:55:55.819875"
}